STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_hal_flash_itf.c
/**
  **********************************************************************************************************************
  * @file    stm32u5xx_hal_flash_itf.c
  * @brief   This file provides Flash interface services.
  **********************************************************************************************************************
  * @attention
  *
  * Copyright (c) 2021-2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  **********************************************************************************************************************
  */

/* Includes ----------------------------------------------------------------------------------------------------------*/
#include "stm32_hal.h"

/** @addtogroup STM32U5xx_HAL_Driver
  * @{
  */

/** @addtogroup FLASH_ITF
  * @{
- This file provides firmware functions to manage the following the Flash interface functionalities:

- Flash ITF lock and unlock
- Flash ITF control
- Flash ITF option bytes configuration
- Flash ITF option bytes process

# Flash interface main features

- The Flash interface, including advanced peripheral interfacing features and "option bytes" configurations
  which often referred to as "OB" in the context of microcontrollers, are a set of configuration settings
  that can be programmed to further customize the behavior of the Flash memory and the microcontroller's features.
  The option bytes are typically stored in a special area of the Flash memory and are used to control various
  aspects of the device's operation.

## Lock mechanism:
After reset, several registers are protected against write access. An unlock sequence is mandatory.
Protected features are:
- Flash programming registers
- Option bytes programming registers

## Access latency:
- To correctly read data from flash memory, the number of wait states (latency) must be correctly programmed
  according to the frequency of the core clock and the internal voltage range of the device VCORE.

## Prefetch:
- Prefetch tends to increase the code execution performance at the cost of extra flash memory accesses.
  It must be used carefully in a low power mode application.

## Power down during run mode:
- After reset, both banks are in normal mode. In order to reduce power consumption,
  each bank can be independently put in power down during run mode.

## Power down during sleep mode:
- After reset, the flash memory is in idle mode during sleep mode. In order to reduce power consumption,
  the flash memory can be put in power down mode during sleep mode.

## Low power read mode:
- After reset, the flash memory is in normal read mode. In order to reduce power consumption,
  each bank can be independently put in low power during read mode.

## Error Code Correction:
- The flash memory is programmed in 137 bits at a time (128-bit data + 9 bits ECC).
  The ECC mechanism allows:
  - One bit error correction.
  - Two bits error detection.In this case an NMI is generated.
- The ECC mechanism protects and verifies the correctness of the flash area content. Handling of ECC errors is
  integrated within the Flash IO module. However, the control of the ECC, including enabling, disabling,
  and checking its status, is integrated within the Flash ITF module.

## Option bytes configuration:
- WRP: The user area in flash memory can be protected against unwanted write operations.
        Two write-protected (WRP) areas can be defined in each bank, with page granularity.

- RDP: The readout protection protects the flash main memory, the option bytes, the backup registers, the backup RAM
        and the SRAMs. In order to reach the best protection level, it is recommended to activate TrustZone
        and to set the RDP Level 2 with password authentication regression enabled.

- Secure Watermark-based area: When TrustZone security is active (TZEN = 1), a part of the flash memory can be
                               protected against NSecure read and write accesses. Up to two different non-volatile
                               secure areas can be defined by option bytes, and can be read or written by a secure
                               access only: one area per bank can be selected with a page granularity

- Secure hide protection area: The secure HDP area is part of the flash memory watermark-based secure area.
                               Access to the hide-protection area can be denied. When is set, instruction fetch,
                               data read, write, and erase operations on this HDP area are denied.

- Boot lock: Available only when the TrustZone is enabled, some option bytes cannot be modified when the boot lock
             mechanism is enabled.

- Boot address: The boot address option bytes are used to program any boot memory address. However, the allowed
                address space depends on flash memory read protection RDP level.

- User option bytes: There are option bytes that must include additional options to customize their behavior such as:
                     Brown-out reset level, reset generation in low power modes, memories erase, watchdog selection,
                     Independent watchdog counter freeze and unfreeze, Bank swapping, Single/Dual bank topology,
                     SRAM ECC Memories, boot0, PA15 IO PullUp, High speed VDD low voltage, TrustZone.

## Option bytes programming:
- When all new options bytes are updated in the flash memory, they are not applied to the system.
  They affect the system when they are loaded. The option bytes loading is performed in two cases:
  - When OBL_LAUNCH is set.
  - After a power reset (BOR reset or exit from Standby or Shutdown mode).

# How to use the FLASH_ITF HAL module driver

## lock and unlock functions:
- Use HAL_FLASH_ITF_Lock() to lock the access to the Flash memory area.
- Use HAL_FLASH_ITF_Unlock() to unlock the access to the Flash memory area.
- Use HAL_FLASH_ITF_IsLocked() to check the access lock state to the Flash memory area.
- Use HAL_FLASH_ITFNS_Lock() to lock the access to the NSecure Flash memory area from secure context.
- Use HAL_FLASH_ITFNS_Unlock() to unlock the access to the NSecure Flash memory area from secure context.
- Use HAL_FLASH_ITFNS_IsLocked() to check the access lock state to the NSecure Flash memory area from secure context.
- Use HAL_FLASH_ITF_OB_Lock() to lock the access to the Flash option bytes programming.
- Use HAL_FLASH_ITF_OB_Unlock() to unlock the access to the Flash option bytes programming.
- Use HAL_FLASH_ITF_OB_IsLocked() to check the lock access state to the Flash option bytes programming.

## Control functions:
- Use HAL_FLASH_ITF_SetLatency() to set the Flash latency.
- Use HAL_FLASH_ITF_GetLatency() to get the Flash latency.
- Use HAL_FLASH_ITF_EnablePrefetch() to enable the Flash prefetch feature.
- Use HAL_FLASH_ITF_DisablePrefetch() to disable the Flash prefetch feature.
- Use HAL_FLASH_ITF_IsEnabledPrefetch() to return the Flash prefetch status.
- Use HAL_FLASH_ITF_EnablePWRDownRunMode() to enable the Flash power down during run mode feature.
- Use HAL_FLASH_ITF_IsEnabledRunModePWRDown() to check the Flash power down during run mode status.
- Use HAL_FLASH_ITF_EnablePWRDownSleepMode() to enable the Flash power down during sleep mode feature.
- Use HAL_FLASH_ITF_DisablePWRDownSleepMode() to disable the Flash power down during sleep mode feature.
- Use HAL_FLASH_ITF_IsEnabledSleepModePWRDown() to check the Flash power down during sleep mode status.
- Use HAL_FLASH_ITF_EnableLowPWRReadMode() to enable the Flash low power read mode feature.
- Use HAL_FLASH_ITF_DisableLowPWRReadMode() disable the Flash low power read mode feature.
- Use HAL_FLASH_ITF_IsEnabledLowPWRReadMode() to check the Flash low power read mode status.
- Use HAL_FLASH_ITF_ECC_EnableIT() to enable the Flash ECC interruption.
- Use HAL_FLASH_ITF_ECC_DisableIT() to disable the Flash ECC interruption.
- Use HAL_FLASH_ITF_ECC_IsEnabledIT() to check the Flash ECC interruption configuration status.
- Use HAL_FLASH_ITF_IsLockedRDPOEM1Key() to check the readout protection OEM1 key lock mechanism state.
- Use HAL_FLASH_ITF_IsLockedRDPOEM2Key() to check the readout protection OEM2 key lock mechanism state.

