STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_hal_flash_itf.c
## Option bytes configuration functions:

## WRP area configuration:
- Use HAL_FLASH_ITF_OB_SetWRPArea() to set the Flash OB WRP area boundaries configuration.
- Use HAL_FLASH_ITF_OB_GetWRPArea() to get the Flash OB WRP area boundaries configuration.
- Use HAL_FLASH_ITF_OB_LockWRPAreaConfig() to lock the Flash OB WRP area boundaries configuration.
- Use HAL_FLASH_ITF_OB_UnlockWRPAreaConfig() to unlock the Flash OB WRP area boundaries configuration.
- Use HAL_FLASH_ITF_OB_IsLockedWRPAreaConfig() to Check the Flash OB WRP area boundaries configuration status.

## RDP level configuration:
- Use HAL_FLASH_ITF_OB_SetRDPLevel() to set the Flash OB readout protection level.
- Use HAL_FLASH_ITF_OB_GetRDPLevel() to get the Flash OB readout protection level.
- Use HAL_FLASH_ITF_OB_SetRDPOEM1Key() to set the Flash OB readout protection OEM1 key.
- Use HAL_FLASH_ITF_OB_SetRDPOEM2Key() to set the Flash OB readout protection OEM2 key.

## BOR level configuration:
- Use HAL_FLASH_ITF_OB_SetBORLevel() to set the Flash OB BOR level.
- Use HAL_FLASH_ITF_OB_GetBORLevel() to get the Flash OB BOR level.

## Enter low power mode reset generation configuration:
- Use HAL_FLASH_ITF_OB_SetEnterLowPWRModeRstGeneration() to set the Flash OB enter low power mode
  reset generation.
- Use HAL_FLASH_ITF_OB_GetEnterLowPWRModeRstGeneration() to get the Flash OB enter low power mode
  reset generation.

## SRAM Erase system reset configuration:
- Use HAL_FLASH_ITF_OB_SetSystemRstSRAMErase() to set the Flash OB SRAM erase system reset configuration.
- Use HAL_FLASH_ITF_OB_GetSystemRstSRAMErase() to get the Flash OB SRAM erase system reset configuration.

## WDG Mode configuration:
- Use HAL_FLASH_ITF_OB_SetIWDGMode() to set the Flash OB IWDG mode.
- Use HAL_FLASH_ITF_OB_GetIWDGMode() to get the Flash OB IWDG mode.
- Use HAL_FLASH_ITF_OB_SetWWDGMode() to set the Flash OB WWDG mode.
- Use HAL_FLASH_ITF_OB_GetWWDGMode() to get the Flash OB WWDG mode.

## WDG Counter freeze configuration:
- Use HAL_FLASH_ITF_OB_FreezeIWDGCounterLowPWRMode() to freeze the Flash OB IWDG counter in stop mode
  or standby mode.
- Use HAL_FLASH_ITF_OB_UnfreezeIWDGCounterLowPWRMode() to unfreeze the Flash OB IWDG counter in stop mode
  or standby mode.
- Use HAL_FLASH_ITF_OB_IsFrozenIWDGCounterLowPWRMode() to check the Flash OB IWDG stop mode or standby mode
  counter freeze configuration status.

## Bank Swapping configuration:
- Use HAL_FLASH_ITF_OB_SetBankSwap() to set the Flash OB swap bank configuration.
- Use HAL_FLASH_ITF_OB_GetBankSwap() to get the Flash OB swap bank configuration.

## Bank Topology configuration:
- Use HAL_FLASH_ITF_OB_SetBankTopology() to set the Flash OB single dual bank configuration.
- Use HAL_FLASH_ITF_OB_GetBankTopology() to get the Flash OB single dual bank configuration.

## SRAM ECC configuration:
- Use HAL_FLASH_ITF_OB_EnableSRAMECC() to enable the Flash OB SRAM ECC configuration.
- Use HAL_FLASH_ITF_OB_DisableSRAMECC() to disable the Flash OB SRAM ECC configuration.
- Use HAL_FLASH_ITF_OB_IsEnabledSRAMECC() to check the Flash OB SRAM ECC configuration status.

## boot0 configuration:
- Use HAL_FLASH_ITF_OB_SetBoot0() to set the Flash OB boot0 configuration.
- Use HAL_FLASH_ITF_OB_GetBoot0() to get the Flash OB boot0 configuration.

## I/O PullUP configuration:
- Use HAL_FLASH_ITF_OB_SetIOPull() to set the Flash OB PA15 PullUP configuration.
- Use HAL_FLASH_ITF_OB_GetIOPull() to get the Flash OB PA15 PullUP configuration status.

## High-speed IO at low VDD voltage configuration:
- Use HAL_FLASH_ITF_OB_EnableVddxHighSpeedLowVoltage() to enable the Flash OB High-speed IO at low VDD
  voltage configuration
- Use HAL_FLASH_ITF_OB_DisableVddxHighSpeedLowVoltage() to disable the Flash OB High-speed IO at low VDD
  voltage configuration
- Use HAL_FLASH_ITF_OB_IsEnabledVddxHighSpeedLowVoltage() to check the Flash OB High-speed IO at low VDD
  voltage configuration status.

## TrustZone configuration:
- Use HAL_FLASH_ITF_OB_EnableTrustZone() to enable the Flash OB TrustZone configuration.
- Use HAL_FLASH_ITF_OB_DisableTrustZone() to disable the Flash OB TrustZone configuration.
- Use HAL_FLASH_ITF_OB_IsEnabledTrustZone() to check the Flash OB TrustZone configuration status.

## Secure WaterMark configuration:
- Use HAL_FLASH_ITF_OB_SetSecureWMArea() to set the Flash OB secure watermark area boundaries configuration.
- Use HAL_FLASH_ITF_OB_GetSecureWMArea() to get the Flash OB secure watermark area boundaries configuration.

## Hide protection configuration:
- Use HAL_FLASH_ITF_OB_SetConfigHDPArea() to set the Flash OB hide protection area boundaries configuration.
- Use HAL_FLASH_ITF_OB_GetConfigHDPArea() to get the Flash OB hide protection area boundaries configuration.
- Use HAL_FLASH_ITF_OB_EnableHDPArea() to enable the Flash OB hide protection area boundaries configuration.
- Use HAL_FLASH_ITF_OB_DisableHDPArea() to disable the Flash OB hide protection area boundaries configuration.
- Use HAL_FLASH_ITF_OB_IsEnabledHDPArea() to Check the Flash OB hide protection area configuration status.

## Boot address configuration:
- Use HAL_FLASH_ITF_OB_SetSecureBootAddr() to set the Flash OB secure boot address configuration.
- Use HAL_FLASH_ITF_OB_GetSecureBootAddr() to get the Flash OB secure boot address configuration.
- Use HAL_FLASH_ITF_OB_SetNSecureBootAddr() to set the Flash OB NSecure boot address configuration.
- Use HAL_FLASH_ITF_OB_GetNSecureBootAddr() to get the Flash OB NSecure boot address configuration.
- Use HAL_FLASH_ITF_OB_LockBootConfig() to lock the Flash OB secure boot address configuration.
- Use HAL_FLASH_ITF_OB_UnlockBootConfig() to unlock the Flash OB secure boot address configuration.
- Use HAL_FLASH_ITF_OB_IsLockedBootConfig() to Check the Flash OB secure boot address configuration status.

## IRQHandler and Callback functions:
- Use HAL_FLASH_ITF_IRQHandler() to handle Flash OB write and error operations.
- Use HAL_FLASH_ITF_OB_ProgramCpltCallback() to be redefined within user application for the OB complete write
  operation callback.
- Use HAL_FLASH_ITF_OB_ErrorCallback() to be redefined within user application for the OB write error
  operation callback.

## Option bytes programming
- Use HAL_FLASH_ITF_OB_Program() to program the Flash option bytes interface.
- Use HAL_FLASH_ITF_OB_Launch() to launch Flash option bytes interface.

# Configuration inside the Flash ITF driver

Configuration defines         | Description     | Default value     | Note                                             |
------------------------------|-----------------|-------------------|--------------------------------------------------|
PRODUCT                       | from IDE        |        NA         | The selected device (e.g., STM32U575xx)          |
USE_HAL_FLASH_ITF_MODULE      | from hal_conf.h |         1         | Allows usage of Flash interface HAL module       |
USE_HAL_FLASH_ITF_ECC         | from hal_conf.h |         1         | Allows enabling ECC mechanism interrupt          |
USE_ASSERT_DBG_PARAM          | from IDE        |       None        | Allows usage of parameter assertions             |
USE_HAL_CHECK_PARAM           | from hal_conf.h |         0         | Allows usage of run-time parameter checks        |
__ARM_FEATURE_CMSE            | from IDE        |         3         | Allows usage of secure access for current context|

  */

#if defined (USE_HAL_FLASH_ITF_MODULE) && (USE_HAL_FLASH_ITF_MODULE == 1U)

/* Private Constants -------------------------------------------------------------------------------------------------*/
/** @defgroup FLASH_ITF_Private_Constants FLASH ITF Private Constants
  * @{
  */
#define FLASH_ITF_BANK_MAX_PAGE_NBR (FLASH_SIZE_DEFAULT / FLASH_PAGE_SIZE / 2U) /*!< Flash ITF Max page number
                                                                                     per bank                  */
#define FLASH_ITF_OB_LOW_PWR_MSK    (HAL_FLASH_ITF_OB_STOP_MODE    | \
                                     HAL_FLASH_ITF_OB_STANDBY_MODE | \
                                     HAL_FLASH_ITF_OB_SHUTDOWN_MODE)            /*!< Flash ITF Low power mask  */

#define FLASH_ITF_OB_SRAM_ERASE_MSK (HAL_FLASH_ITF_OB_SRAM | \
                                     HAL_FLASH_ITF_OB_SRAM2)                    /*!< Flash ITF SRAM erase mask */

#define FLASH_ITF_OB_WDG_MSK        (HAL_FLASH_ITF_OB_IWDG | \
                                     HAL_FLASH_ITF_OB_WWDG)                     /*!< Flash ITF WDG mask        */

