STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_hal_flash_itf.c
#if defined (SRAM3_BASE)
#define FLASH_ITF_OB_SRAM_ECC_MSK   (HAL_FLASH_ITF_OB_BKPRAM | \
                                     HAL_FLASH_ITF_OB_SRAM2  | \
                                     HAL_FLASH_ITF_OB_SRAM3)                    /*!< Flash ITF SRAM ECC mask   */
#else
#define FLASH_ITF_OB_SRAM_ECC_MSK   (HAL_FLASH_ITF_OB_BKPRAM | \
                                     HAL_FLASH_ITF_OB_SRAM2)                    /*!< Flash ITF SRAM ECC mask   */
#endif /* SRAM3_BASE */

#define HAL_FLASH_ITF_OB_VDDIO_MSK  (HAL_FLASH_ITF_OB_VDDIO | \
                                     HAL_FLASH_ITF_OB_VDDIO2)                   /*!< Flash ITF VDDIO mask      */

/**
  * @}
  */

/* Private macros ----------------------------------------------------------------------------------------------------*/
/** @defgroup FLASH_ITF_Private_Macros FLASH ITF Private Macros
  * @{
  */

/*! Macro to check Flash ITF latency value */
#define IS_FLASH_ITF_LATENCY(value) (((value) == HAL_FLASH_ITF_LATENCY_0)     \
                                     || ((value) == HAL_FLASH_ITF_LATENCY_1)  \
                                     || ((value) == HAL_FLASH_ITF_LATENCY_2)  \
                                     || ((value) == HAL_FLASH_ITF_LATENCY_3)  \
                                     || ((value) == HAL_FLASH_ITF_LATENCY_4)  \
                                     || ((value) == HAL_FLASH_ITF_LATENCY_5)  \
                                     || ((value) == HAL_FLASH_ITF_LATENCY_6)  \
                                     || ((value) == HAL_FLASH_ITF_LATENCY_7)  \
                                     || ((value) == HAL_FLASH_ITF_LATENCY_8)  \
                                     || ((value) == HAL_FLASH_ITF_LATENCY_9)  \
                                     || ((value) == HAL_FLASH_ITF_LATENCY_10) \
                                     || ((value) == HAL_FLASH_ITF_LATENCY_11) \
                                     || ((value) == HAL_FLASH_ITF_LATENCY_12) \
                                     || ((value) == HAL_FLASH_ITF_LATENCY_13) \
                                     || ((value) == HAL_FLASH_ITF_LATENCY_14) \
                                     || ((value) == HAL_FLASH_ITF_LATENCY_15))

/*! Macro to check Flash ITF Bank Selection */
#define IS_FLASH_ITF_BANK(value) (((value) == HAL_FLASH_ITF_BANK_1) \
                                  || ((value) == HAL_FLASH_ITF_BANK_2))

/*! Macro to check Flash ITF OB Bank Area */
#define IS_FLASH_ITF_OB_BANK_AREA(value) (((value) == HAL_FLASH_ITF_OB_BANK_AREA_A) \
                                          || ((value) == HAL_FLASH_ITF_OB_BANK_AREA_B))

/*! Macro to check Flash ITF OB RDP Level */
#define IS_FLASH_ITF_OB_RDP_LEVEL(value) (((value) == HAL_FLASH_ITF_OB_RDP_LEVEL_0)      \
                                          || ((value) == HAL_FLASH_ITF_OB_RDP_LEVEL_0_5) \
                                          || ((value) == HAL_FLASH_ITF_OB_RDP_LEVEL_1)   \
                                          || ((value) == HAL_FLASH_ITF_OB_RDP_LEVEL_2))

/*! Macro to check Flash ITF OB RDP OEM key */
#define IS_FLASH_ITF_OB_RDP_OEM_KEY_TYPE(value) (((value) == HAL_FLASH_ITF_OB_RDP_KEY_OEM1) \
                                                 || ((value) == HAL_FLASH_ITF_OB_RDP_KEY_OEM2))

/*! Macro to check Flash ITF OB BOR Level */
#define IS_FLASH_ITF_OB_BOR_LEVEL(value) (((value) == HAL_FLASH_ITF_OB_BOR_LEVEL_0)    \
                                          || ((value) == HAL_FLASH_ITF_OB_BOR_LEVEL_1) \
                                          || ((value) == HAL_FLASH_ITF_OB_BOR_LEVEL_2) \
                                          || ((value) == HAL_FLASH_ITF_OB_BOR_LEVEL_3) \
                                          || ((value) == HAL_FLASH_ITF_OB_BOR_LEVEL_4))

/*! Macro to check Flash ITF OB Low power mode */
#define IS_FLASH_ITF_OB_LOW_PWR_MODE(value) (((value) == HAL_FLASH_ITF_OB_STOP_MODE)       \
                                             || ((value) == HAL_FLASH_ITF_OB_STANDBY_MODE) \
                                             || ((value) == HAL_FLASH_ITF_OB_SHUTDOWN_MODE))

/*! Macro to check Flash ITF OB Low power mode reset generation */
#define IS_FLASH_OB_RST_GENERATION(value) (((value) == HAL_FLASH_ITF_OB_RST_GENERATION) \
                                           || ((value) == HAL_FLASH_ITF_OB_NO_RST_GENERATION))

/*! Macro to check Flash ITF OB SRAM Erase*/
#define IS_FLASH_ITF_OB_SRAM_ERASE(value) (((value) == HAL_FLASH_ITF_OB_SRAM2) \
                                           || ((value) == HAL_FLASH_ITF_OB_SRAM))

/*! Macro to check Flash ITF OB SRAM erase system reset */
#define IS_FLASH_ITF_OB_SYS_RST_SRAM_ERASE(value) (((value) == HAL_FLASH_ITF_OB_SYS_RST_SRAM_ERASE) \
                                                   || ((value) == HAL_FLASH_ITF_OB_SYS_RST_SRAM_NO_ERASE))

/*! Macro to check Flash ITF OB WDG */
#define IS_FLASH_ITF_OB_WDG(value) (((value) == HAL_FLASH_ITF_OB_IWDG) \
                                    || ((value) == HAL_FLASH_ITF_OB_WWDG))

/*! Macro to check Flash ITF OB WDG Mode */
#define IS_FLASH_ITF_OB_WDG_HW_SW_MODE(value) (((value) == HAL_FLASH_ITF_OB_WDG_HARDWARE) \
                                               || ((value) == HAL_FLASH_ITF_OB_WDG_SOFTWARE))

/*! Macro to check Flash ITF OB Bank Swap*/
#define IS_FLASH_ITF_OB_SWAP_BANK(value) (((value) == HAL_FLASH_ITF_OB_BANK_NO_SWAP) \
                                          || ((value) == HAL_FLASH_ITF_OB_BANK_SWAP))

/*! Macro to check Flash ITF OB Bank Topology */
#define IS_FLASH_ITF_OB_SINGLE_DUAL_BANK(value) (((value) == HAL_FLASH_ITF_OB_SINGLE_BANK) \
                                                 || ((value) == HAL_FLASH_ITF_OB_DUAL_BANK))

/*! Macro to check Flash ITF OB SRAM ECC */
#if defined (SRAM3_BASE)
#define IS_FLASH_ITF_OB_SRAM_ECC(value) (((value) == HAL_FLASH_ITF_OB_BKPRAM)   \
                                         || ((value) == HAL_FLASH_ITF_OB_SRAM2) \
                                         || ((value) == HAL_FLASH_ITF_OB_SRAM3))
#else
#define IS_FLASH_ITF_OB_SRAM_ECC(value) (((value) == HAL_FLASH_ITF_OB_BKPRAM) \
                                         || ((value) == HAL_FLASH_ITF_OB_SRAM2))
#endif /* SRAM3_BASE */

/*! Macro to check Flash ITF OB boot0 Selection */
#define IS_FLASH_ITF_OB_BOOT0_SELECTION(value) (((value) == HAL_FLASH_ITF_OB_BOOT_PIN) \
                                                || ((value) == HAL_FLASH_ITF_OB_BOOT_OPTION_BIT))

