STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_hal_flash_itf.c
/*! Macro to check Flash ITF OB boot0 State */
#define IS_FLASH_ITF_OB_BOOT_STATE(value) (((value) == HAL_FLASH_ITF_OB_BOOT_LOW) \
                                           || ((value) == HAL_FLASH_ITF_OB_BOOT_HIGH))

/*! Macro to check Flash ITF OB pull mode */
#define IS_FLASH_ITF_OB_PULL_MODE(value) (((value) == HAL_FLASH_ITF_OB_PULL_NO)      \
                                          || ((value) == HAL_FLASH_ITF_OB_PULL_DOWN) \
                                          || ((value) == HAL_FLASH_ITF_OB_PULL_UP))

/*! Macro to check Flash ITF OB vdd */
#define IS_FLASH_ITF_OB_VDD(value) (((value) == HAL_FLASH_ITF_OB_VDDIO) \
                                    || ((value) == HAL_FLASH_ITF_OB_VDDIO2))

/*! Macro to check Flash ITF OB address index */
#define IS_FLASH_ITF_OB_ADDR_IDX(value) (((value) == HAL_FLASH_ITF_OB_ADDR_0) \
                                         || ((value) == HAL_FLASH_ITF_OB_ADDR_1))

/*! Macro to get the Flash Bank power down key 1 */
#define FLASH_ITF_GET_PWR_DOWN_BANK_KEY1(value) (((value) == HAL_FLASH_ITF_BANK_1) ? LL_FLASH_PDKEY1_1 \
                                                 : LL_FLASH_PDKEY2_1)

/*! Macro to get the Flash Bank power down key 2 */
#define FLASH_ITF_GET_PWR_DOWN_BANK_KEY2(value) (((value) == HAL_FLASH_ITF_BANK_1) ? LL_FLASH_PDKEY1_2 \
                                                 : LL_FLASH_PDKEY2_2)

/*! Macro to get the Flash Bank power down request*/
#define FLASH_ITF_GET_PWR_DOWN_BANK_REQUEST(value) (((value) == HAL_FLASH_ITF_BANK_1) ? LL_FLASH_PWR_DOWN_RUN_BANK_1 \
                                                    : LL_FLASH_PWR_DOWN_RUN_BANK_2)

/*! Macro to get the Flash Bank power down */
#define FLASH_ITF_GET_PWR_DOWN_BANK(value) (((value) == HAL_FLASH_ITF_BANK_1) ? LL_FLASH_FLAG_PD1 \
                                            : LL_FLASH_FLAG_PD2)

/**
  * @}
  */

/* Exported functions ------------------------------------------------------------------------------------------------*/
/** @addtogroup FLASH_ITF_Exported_Functions
  * @{
  */

/** @addtogroup FLASH_ITF_Exported_Functions_Group1
  * @{
  * This subsection provides a set of functions for the Flash interface lock and unlock features:

  * - Call HAL_FLASH_ITF_Lock() to lock the access to the Flash memory area.

  * - Call HAL_FLASH_ITF_Unlock() to unlock the access to the Flash memory area.

  * - Call HAL_FLASH_ITF_IsLocked() to check the access lock state to the Flash memory area.

  * - Call HAL_FLASH_ITFNS_Lock() to lock the access to the Flash memory area from secure context.

  * - Call HAL_FLASH_ITFNS_Unlock() to unlock the access to the NSecure Flash memory area from secure context.

  * - Call HAL_FLASH_ITFNS_IsLocked() to check the access lock state to the NSecure Flash memory area
      from secure context.

  * - Call HAL_FLASH_ITF_OB_Lock() to lock the access to the Flash option bytes programming.

  * - Call HAL_FLASH_ITF_OB_Unlock() to unlock the access to the Flash option bytes programming.

  * - Call HAL_FLASH_ITF_OB_IsLocked() to check the lock access state to the Flash option bytes programming.

  */

/**
  * @brief  Lock the access to the Flash memory area.
  * @param  flash             Pointer to FLASH_TypeDef structure.
  * @retval HAL_OK            Flash control register access is successfully locked.
  */
hal_status_t HAL_FLASH_ITF_Lock(FLASH_TypeDef *flash)
{
  ASSERT_DBG_PARAM(flash != NULL);

  LL_FLASH_Lock(flash);

  return HAL_OK;
}

/**
  * @brief  Unlock the access to the Flash memory area.
  * @param  flash             Pointer to FLASH_TypeDef structure.
  * @retval HAL_OK            Flash control register access is successfully unlocked.
  */
hal_status_t HAL_FLASH_ITF_Unlock(FLASH_TypeDef *flash)
{
  ASSERT_DBG_PARAM(flash != NULL);

  if (LL_FLASH_IsLocked(flash) != 0U)
  {
    LL_FLASH_SetUnlockKey(flash, LL_FLASH_KEY1);
    LL_FLASH_SetUnlockKey(flash, LL_FLASH_KEY2);
  }

  return HAL_OK;
}

/**
  * @brief  Check the access lock state to the Flash memory area.
  * @param  flash                                  Pointer to FLASH_TypeDef structure.
  * @retval hal_flash_itf_lock_status_t            Flash control register access lock status.
  */
hal_flash_itf_lock_status_t HAL_FLASH_ITF_IsLocked(const FLASH_TypeDef *flash)
{
  ASSERT_DBG_PARAM(flash != NULL);

  return ((hal_flash_itf_lock_status_t)LL_FLASH_IsLocked(flash));
}

#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
/**
  * @brief  Lock the access to the NSecure Flash memory area from secure context.
  * @param  flash             Pointer to FLASH_TypeDef structure.
  * @retval HAL_OK            Flash NSecure control register access is successfully locked.
  */
hal_status_t HAL_FLASH_ITFNS_Lock(FLASH_TypeDef *flash)
{
  ASSERT_DBG_PARAM(flash != NULL);

  LL_FLASH_NS_Lock(flash);

  return HAL_OK;
}

/**
  * @brief  Unlock the access to the NSecure Flash memory area from secure context.
  * @param  flash             Pointer to FLASH_TypeDef structure.
  * @retval HAL_OK            Flash NSecure control register access is successfully unlocked.
  */
hal_status_t HAL_FLASH_ITFNS_Unlock(FLASH_TypeDef *flash)
{
  ASSERT_DBG_PARAM(flash != NULL);

  if (LL_FLASH_NS_IsLocked(flash) != 0U)
  {
    LL_FLASH_NS_SetUnlockKey(flash, LL_FLASH_KEY1);
    LL_FLASH_NS_SetUnlockKey(flash, LL_FLASH_KEY2);
  }

  return HAL_OK;
}

/**
  * @brief  Check the access lock state to the NSecure Flash memory area from secure context.
  * @param  flash                                  Pointer to FLASH_TypeDef structure.
  * @retval hal_flash_itf_lock_status_t            Flash NSecure control register access lock status.
  */
hal_flash_itf_lock_status_t HAL_FLASH_ITFNS_IsLocked(const FLASH_TypeDef *flash)
{
  ASSERT_DBG_PARAM(flash != NULL);

  return ((hal_flash_itf_lock_status_t)LL_FLASH_NS_IsLocked(flash));
}
#endif /* __ARM_FEATURE_CMSE */

/**
  * @brief  Lock the Flash OB control register access.
  * @warning When locking the flash OB, the flash will not be locked.
  * @param  flash             Pointer to FLASH_TypeDef structure.
  * @retval HAL_OK            Flash OB control register access is successfully locked.
  */
hal_status_t HAL_FLASH_ITF_OB_Lock(FLASH_TypeDef *flash)
{
  ASSERT_DBG_PARAM(flash != NULL);

  LL_FLASH_OB_Lock(flash);

  return HAL_OK;
}

/**
  * @brief  Unlock the Flash OB control register access.
  * @warning When unlocking the flash OB, the flash is unlocked as side effect.
  * @param  flash             Pointer to FLASH_TypeDef structure.
  * @retval HAL_OK            Flash OB control register access is successfully unlocked.
  */
hal_status_t HAL_FLASH_ITF_OB_Unlock(FLASH_TypeDef *flash)
{
  ASSERT_DBG_PARAM(flash != NULL);

#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
  if (LL_FLASH_NS_IsLocked(flash) == 1U)
  {
    LL_FLASH_NS_SetUnlockKey(flash, LL_FLASH_KEY1);
    LL_FLASH_NS_SetUnlockKey(flash, LL_FLASH_KEY2);
  }
#else
  if (LL_FLASH_IsLocked(flash) == 1U)
  {
    LL_FLASH_SetUnlockKey(flash, LL_FLASH_KEY1);
    LL_FLASH_SetUnlockKey(flash, LL_FLASH_KEY2);
  }
#endif /* __ARM_FEATURE_CMSE */

  if (LL_FLASH_OB_IsLocked(flash) == 1U)
  {
    LL_FLASH_OB_SetUnlockKey(flash, LL_FLASH_OB_OPTKEY1);
    LL_FLASH_OB_SetUnlockKey(flash, LL_FLASH_OB_OPTKEY2);
  }

  return HAL_OK;
}

/**
  * @brief  Check the Flash OB control register access lock status.
  * @param  flash                                     Pointer to FLASH_TypeDef structure.
  * @retval hal_flash_itf_ob_lock_status_t            Flash OB control register access lock status.
  */
hal_flash_itf_ob_lock_status_t HAL_FLASH_ITF_OB_IsLocked(const FLASH_TypeDef *flash)
{
  ASSERT_DBG_PARAM(flash != NULL);

  return (hal_flash_itf_ob_lock_status_t)LL_FLASH_OB_IsLocked(flash);
}

/**
  * @}
  */

/** @addtogroup FLASH_ITF_Exported_Functions_Group2
  * @{
  * This subsection provides a set of functions for the Flash interface control features:

