STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_hal_flash_itf.c
  * - Call HAL_FLASH_ITF_SetLatency() to set the Flash latency value.

  * - Call HAL_FLASH_ITF_GetLatency() to get the Flash latency value.

  * - Call HAL_FLASH_ITF_EnablePrefetch() to enable the Flash prefetch feature.

  * - Call HAL_FLASH_ITF_DisablePrefetch() to disable the Flash prefetch feature.

  * - Call HAL_FLASH_ITF_IsEnabledPrefetch() to check the status of the Flash prefetch feature.

  * - Call HAL_FLASH_ITF_EnablePWRDownRunMode() to enable Flash power down during run mode feature.

  * - Call HAL_FLASH_ITF_IsEnabledRunModePWRDown() to check the status of Flash power down during run mode feature.

  * - Call HAL_FLASH_ITF_EnablePWRDownSleepMode() to enable Flash power down during sleep mode feature.

  * - Call HAL_FLASH_ITF_DisablePWRDownSleepMode() to disable Flash power down during sleep mode feature.

  * - Call HAL_FLASH_ITF_IsEnabledSleepModePWRDown() to check the status of Flash power down during sleep mode feature.

  * - Call HAL_FLASH_ITF_EnableLowPWRReadMode() to enable Flash low power during read mode feature.

  * - Call HAL_FLASH_ITF_DisableLowPWRReadMode() to disable Flash low power during read mode feature.

  * - Call HAL_FLASH_ITF_IsEnabledLowPWRReadMode() to check the status of Flash low power during read mode feature.

  * - Call HAL_FLASH_ITF_ECC_EnableIT() to enable Flash ECC interruption.

  * - Call HAL_FLASH_ITF_ECC_DisableIT() to disable Flash ECC interruption.

  * - Call HAL_FLASH_ITF_ECC_IsEnabledIT() to check the Flash ECC interruption configuration status.

  * - Call HAL_FLASH_ITF_IsLockedRDPOEM1Key() to check the Readout protection OEM1 key lock status.

  * - Call HAL_FLASH_ITF_IsLockedRDPOEM2Key() to check the Readout protection OEM2 key lock status.

  */

/**
  * @brief  Set the Flash latency configuration.
  * @param  flash              Pointer to FLASH_TypeDef structure.
  * @param  latency            This parameter is an element of \ref hal_flash_itf_latency_t enumeration.
  * @retval HAL_OK             Flash latency is successfully configured.
  */
hal_status_t HAL_FLASH_ITF_SetLatency(FLASH_TypeDef *flash, hal_flash_itf_latency_t latency)
{
  ASSERT_DBG_PARAM(flash != NULL);
  ASSERT_DBG_PARAM(IS_FLASH_ITF_LATENCY(latency));

  LL_FLASH_SetLatency(flash, (uint32_t)latency);

  return HAL_OK;
}

/**
  * @brief  Get the Flash latency configuration.
  * @param  flash                              Pointer to FLASH_TypeDef structure.
  * @retval hal_flash_itf_latency_t            Flash latency value.
  */
hal_flash_itf_latency_t HAL_FLASH_ITF_GetLatency(const FLASH_TypeDef *flash)
{
  ASSERT_DBG_PARAM(flash != NULL);

  return ((hal_flash_itf_latency_t)LL_FLASH_GetLatency(flash));
}

/**
  * @brief  Enable the Flash prefetch feature.
  * @param  flash             Pointer to FLASH_TypeDef structure.
  * @retval HAL_OK            Flash prefetch feature is successfully enabled.
  */
hal_status_t HAL_FLASH_ITF_EnablePrefetch(FLASH_TypeDef *flash)
{
  ASSERT_DBG_PARAM(flash != NULL);

  LL_FLASH_EnablePrefetch(flash);

  return HAL_OK;
}

/**
  * @brief  Disable the Flash prefetch feature.
  * @param  flash             Pointer to FLASH_TypeDef structure.
  * @retval HAL_OK            Flash prefetch feature is successfully disabled.
  */
hal_status_t HAL_FLASH_ITF_DisablePrefetch(FLASH_TypeDef *flash)
{
  ASSERT_DBG_PARAM(flash != NULL);

  LL_FLASH_DisablePrefetch(flash);

  return HAL_OK;
}

/**
  * @brief  Return the Flash prefetch status
  * @param  flash             Pointer to FLASH_TypeDef structure.
  * @retval hal_flash_itf_prefetch_status_t            Flash prefetch status.
  */
hal_flash_itf_prefetch_status_t HAL_FLASH_ITF_IsEnabledPrefetch(const FLASH_TypeDef *flash)
{
  ASSERT_DBG_PARAM(flash != NULL);

  return ((hal_flash_itf_prefetch_status_t)LL_FLASH_IsEnabledPrefetch(flash));
}

/**
  * @brief  Enable the Flash power down during run mode configuration.
  * @note   Any access to the Flash memory can disable the power down during run mode.
  * @param  flash           Pointer to FLASH_TypeDef structure.
  * @param  bank            This parameter is an element of \ref hal_flash_itf_bank_t enumeration.
  * @retval HAL_OK          Flash power down during run mode configuration is successfully enabled.
  */
hal_status_t HAL_FLASH_ITF_EnablePWRDownRunMode(FLASH_TypeDef *flash, hal_flash_itf_bank_t bank)
{
  ASSERT_DBG_PARAM(flash != NULL);
  ASSERT_DBG_PARAM(IS_FLASH_ITF_BANK(bank));

  LL_FLASH_BANK_SetPWRDownRunModeKey(flash, (uint32_t)bank, FLASH_ITF_GET_PWR_DOWN_BANK_KEY1(bank));
  LL_FLASH_BANK_SetPWRDownRunModeKey(flash, (uint32_t)bank, FLASH_ITF_GET_PWR_DOWN_BANK_KEY2(bank));

  LL_FLASH_BANK_RequestPWRDownRunMode(flash, FLASH_ITF_GET_PWR_DOWN_BANK_REQUEST(bank));

  return HAL_OK;
}

/**
  * @brief  Check the Flash power down during run mode configuration status.
  * @note   Any access to the Flash memory can disable the power down during run mode.
  * @param  flash                                     Pointer to FLASH_TypeDef structure.
  * @param  bank                                      Element of \ref hal_flash_itf_bank_t enumeration.
  * @retval hal_flash_itf_pwr_down_run_status_t       Flash power down during run mode configuration status.
  */
hal_flash_itf_pwr_down_run_status_t HAL_FLASH_ITF_IsEnabledRunModePWRDown(const FLASH_TypeDef *flash,
                                                                          const hal_flash_itf_bank_t bank)
{
  ASSERT_DBG_PARAM(flash != NULL);
  ASSERT_DBG_PARAM(IS_FLASH_ITF_BANK(bank));

  return ((hal_flash_itf_pwr_down_run_status_t)LL_FLASH_IsActiveFlag_PD(flash, FLASH_ITF_GET_PWR_DOWN_BANK(bank)));
}

/**
  * @brief  Enable the Flash power down during sleep mode configuration.
  * @param  flash             Pointer to FLASH_TypeDef structure.
  * @retval HAL_OK            Flash power down during sleep mode configuration is successfully enabled.
  */
hal_status_t HAL_FLASH_ITF_EnablePWRDownSleepMode(FLASH_TypeDef *flash)
{
  ASSERT_DBG_PARAM(flash != NULL);

  LL_FLASH_SetPWRDownSleepMode(flash, LL_FLASH_PWR_DOWN_SLEEP_MODE);

  return HAL_OK;
}

/**
  * @brief  Disable the Flash power down during sleep mode configuration.
  * @param  flash             Pointer to FLASH_TypeDef structure.
  * @retval HAL_OK            Flash power down during sleep mode configuration is successfully disabled.
  */
hal_status_t HAL_FLASH_ITF_DisablePWRDownSleepMode(FLASH_TypeDef *flash)
{
  ASSERT_DBG_PARAM(flash != NULL);

  LL_FLASH_SetPWRDownSleepMode(flash, LL_FLASH_IDLE_SLEEP_MODE);

  return HAL_OK;
}

/**
  * @brief  Check the Flash power down during sleep mode configuration status.
  * @param  flash                                            Pointer to FLASH_TypeDef structure.
  * @retval hal_flash_itf_pwr_down_sleep_status_t            Flash power down during sleep mode configuration status.
  */
hal_flash_itf_pwr_down_sleep_status_t HAL_FLASH_ITF_IsEnabledSleepModePWRDown(const FLASH_TypeDef *flash)
{
  ASSERT_DBG_PARAM(flash != NULL);

  return ((hal_flash_itf_pwr_down_sleep_status_t)
          ((uint32_t)(LL_FLASH_GetPWRDownSleepMode(flash) >> FLASH_ACR_SLEEP_PD_Pos)));
}

/**
  * @brief  Enable the Flash low power read mode configuration.
  * @param  flash             Pointer to FLASH_TypeDef structure.
  * @retval HAL_OK            Low power read mode configuration is successfully enabled.
  */
hal_status_t HAL_FLASH_ITF_EnableLowPWRReadMode(FLASH_TypeDef *flash)
{
  ASSERT_DBG_PARAM(flash != NULL);

  LL_FLASH_EnableLowPWRReadMode(flash);

  return HAL_OK;
}

/**
  * @brief  Disable the Flash low power read mode configuration.
  * @param  flash             Pointer to FLASH_TypeDef structure.
  * @retval HAL_OK            Low power read mode is successfully disabled.
  */
hal_status_t HAL_FLASH_ITF_DisableLowPWRReadMode(FLASH_TypeDef *flash)
{
  ASSERT_DBG_PARAM(flash != NULL);

  LL_FLASH_DisableLowPWRReadMode(flash);

  return HAL_OK;
}

/**
  * @brief  Check the Flash low power read mode configuration status.
  * @param  flash                                          Pointer to FLASH_TypeDef structure.
  * @retval hal_flash_itf_low_pwr_read_status_t            Flash low power read mode configuration status.
  */
hal_flash_itf_low_pwr_read_status_t HAL_FLASH_ITF_IsEnabledLowPWRReadMode(const FLASH_TypeDef *flash)
{
  ASSERT_DBG_PARAM(flash != NULL);

  return ((hal_flash_itf_low_pwr_read_status_t)LL_FLASH_IsEnabledLowPWRReadMode(flash));
}

#if defined (USE_HAL_FLASH_ITF_ECC) && (USE_HAL_FLASH_ITF_ECC == 1U)
/**
  * @brief  Enable the Flash Error code correction interruption.
  * @param  flash             Pointer to FLASH_TypeDef structure.
  * @retval HAL_OK            Flash Error code correction interruption is successfully enabled.
  */
hal_status_t HAL_FLASH_ITF_ECC_EnableIT(FLASH_TypeDef *flash)
{
  ASSERT_DBG_PARAM(flash != NULL);

