STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_hal_flash_itf.c
  LL_FLASH_EnableIT_ECC(flash);

  return HAL_OK;
}

/**
  * @brief  Disable the Flash Error code correction interruption.
  * @param  flash             Pointer to FLASH_TypeDef structure.
  * @retval HAL_OK            Flash Error code correction interruption is successfully disabled.
  */
hal_status_t HAL_FLASH_ITF_ECC_DisableIT(FLASH_TypeDef *flash)
{
  ASSERT_DBG_PARAM(flash != NULL);

  LL_FLASH_DisableIT_ECC(flash);

  return HAL_OK;
}

/**
  * @brief  Check the Flash ECC interrupt status.
  * @param  flash                          Pointer to FLASH_TypeDef structure.
  * @retval hal_flash_itf_ecc_it_status_t  Flash ECC interrupt status.
  */
hal_flash_itf_ecc_it_status_t HAL_FLASH_ITF_ECC_IsEnabledIT(const FLASH_TypeDef *flash)
{
  ASSERT_DBG_PARAM(flash != NULL);

  return ((hal_flash_itf_ecc_it_status_t)LL_FLASH_IsEnabledIT_ECC(flash));
}
#endif /* USE_HAL_FLASH_ITF_ECC */

/**
  * @brief  Check the Flash Readout Protection OEM1 key lock status.
  * @param  flash                                Pointer to FLASH_TypeDef structure.
  * @retval hal_flash_itf_rdp_key_lock_status_t  Flash Readout Protection OEM1 key lock status.
  */
hal_flash_itf_rdp_key_lock_status_t HAL_FLASH_ITF_IsLockedRDPOEM1Key(const FLASH_TypeDef *flash)
{
  ASSERT_DBG_PARAM(flash != NULL);

  return ((hal_flash_itf_rdp_key_lock_status_t)LL_FLASH_IsActiveFlag_OEM1LOCK(flash));
}

/**
  * @brief  Check the Flash Readout Protection OEM2 key lock status.
  * @param  flash                                Pointer to FLASH_TypeDef structure.
  * @retval hal_flash_itf_rdp_key_lock_status_t  Flash Readout Protection OEM2 key lock status.
  */
hal_flash_itf_rdp_key_lock_status_t HAL_FLASH_ITF_IsLockedRDPOEM2Key(const FLASH_TypeDef *flash)
{
  ASSERT_DBG_PARAM(flash != NULL);

  return ((hal_flash_itf_rdp_key_lock_status_t)LL_FLASH_IsActiveFlag_OEM1LOCK(flash));
}

/**
  * @}
  */

/** @addtogroup FLASH_ITF_Exported_Functions_Group3
  * @{
  * This subsection provides a set of functions to configure the Flash option bytes interface:

  * - Call HAL_FLASH_ITF_OB_SetWRPArea() to set the Flash OB WRP area boundaries configuration.

  * - Call HAL_FLASH_ITF_OB_GetWRPArea() to get the Flash OB WRP area boundaries configuration.

  * - Call HAL_FLASH_ITF_OB_LockWRPAreaConfig() to lock the Flash OB WRP area boundaries configuration.

  * - Call HAL_FLASH_ITF_OB_UnlockWRPAreaConfig() to unlock the Flash OB WRP area boundaries configuration.

  * - Call HAL_FLASH_ITF_OB_IsLockedWRPAreaConfig() to check the lock status of the Flash OB WRP area boundaries
      configuration.

  * - Call HAL_FLASH_ITF_OB_SetRDPLevel() to set the Flash OB readout protection level.

  * - Call HAL_FLASH_ITF_OB_GetRDPLevel() to get the Flash OB readout protection level.

  * - Call HAL_FLASH_ITF_OB_SetRDPOEMKey() to set the Flash OB readout protection OEM keys.

  * - Call HAL_FLASH_ITF_OB_SetBORLevel() to set the Flash OB BOR level.

  * - Call HAL_FLASH_ITF_OB_GetBORLevel() to get the Flash OB BOR level.

  * - Call HAL_FLASH_ITF_OB_SetEnterLowPWRModeRstGeneration() to set the Flash OB low power mode reset generation.

  * - Call HAL_FLASH_ITF_OB_GetEnterLowPWRModeRstGeneration() to get the Flash OB low power mode reset generation.

  * - Call HAL_FLASH_ITF_OB_SetSystemRstSRAMErase() to set the Flash OB SRAM erase upon system reset.

  * - Call HAL_FLASH_ITF_OB_GetSystemRstSRAMErase() to get the Flash OB SRAM erase upon system reset.

  * - Call HAL_FLASH_ITF_OB_SetIWDGMode() to set the Flash OB IWDG mode selection.

  * - Call HAL_FLASH_ITF_OB_GetIWDGMode() to get the Flash OB IWDG mode selection.

  * - Call HAL_FLASH_ITF_OB_SetWWDGMode() to set the Flash OB WWDG mode selection.

  * - Call HAL_FLASH_ITF_OB_GetWWDGMode() to get the Flash OB WWDG mode selection.

  * - Call HAL_FLASH_ITF_OB_FreezeIWDGCounterLowPWRMode() to freeze the Flash OB IWDG counter in low power mode
      configuration.

  * - Call HAL_FLASH_ITF_OB_UnfreezeIWDGCounterLowPWRMode() to unfreeze the Flash OB IWDG counter in low power mode
      configuration.

  * - Call HAL_FLASH_ITF_OB_IsFrozenIWDGCounterLowPWRMode() to check the status of the Flash OB IWDG counter in low
      power mode configuration.

  * - Call HAL_FLASH_ITF_OB_SetBankSwap() to set the Flash OB bank swapping configuration.

  * - Call HAL_FLASH_ITF_OB_GetBankSwap() to get the Flash OB bank swapping configuration.

  * - Call HAL_FLASH_ITF_OB_SetBankTopology() to set the Flash OB bank topology configuration.

  * - Call HAL_FLASH_ITF_OB_GetBankTopology() to get the Flash OB bank topology configuration.

  * - Call HAL_FLASH_ITF_OB_EnableSRAMECC() to enable the Flash OB SRAM ECC configuration.

  * - Call HAL_FLASH_ITF_OB_DisableSRAMECC() to disable the Flash OB SRAM ECC configuration.

  * - Call HAL_FLASH_ITF_OB_IsEnabledSRAMECC() to check the status of the Flash OB SRAM ECC configuration.

  * - Call HAL_FLASH_ITF_OB_SetBoot0() to set the Flash OB boot0 configuration.

  * - Call HAL_FLASH_ITF_OB_GetBoot0() to get the Flash OB boot0 configuration.

  * - Call HAL_FLASH_ITF_OB_SetIOPull() to set the Flash OB PA15 pull-up configuration.

  * - Call HAL_FLASH_ITF_OB_GetIOPull() to get the Flash OB PA15 pull-up configuration.

  * - Call HAL_FLASH_ITF_OB_EnableVddxHighSpeedLowVoltage() to enable the Flash OB HSLV VDDIO configuration.

  * - Call HAL_FLASH_ITF_OB_DisableVddxHighSpeedLowVoltage() to disable the Flash OB HSLV VDDIO configuration.

  * - Call HAL_FLASH_ITF_OB_IsEnabledVddxHighSpeedLowVoltage() to check the status of the Flash OB HSLV VDDIO
      configuration.
.
  * - Call HAL_FLASH_ITF_OB_EnableTrustZone() to enable the Flash OB TrustZone configuration.

  * - Call HAL_FLASH_ITF_OB_DisableTrustZone() to disable the Flash OB TrustZone configuration.

  * - Call HAL_FLASH_ITF_OB_IsEnabledTrustZone() to check the status of the Flash OB TrustZone configuration.

  * - Call HAL_FLASH_ITF_OB_SetSecureWMArea() to set the Flash OB secure watermark area boundaries configuration.

  * - Call HAL_FLASH_ITF_OB_GetSecureWMArea() to get the Flash OB secure watermark area boundaries configuration.

  * - Call HAL_FLASH_ITF_OB_SetConfigHDPArea() to set the Flash OB hide protection area boundaries configuration.

  * - Call HAL_FLASH_ITF_OB_GetConfigHDPArea() to get the Flash OB hide protection area boundaries configuration.

  * - Call HAL_FLASH_ITF_OB_EnableHDPArea() to enable the Flash OB hide protection area configuration.

