STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_hal_flash_itf.c
  * - Call HAL_FLASH_ITF_OB_DisableHDPArea() to disable the Flash OB hide protection area configuration.

  * - Call HAL_FLASH_ITF_OB_IsEnabledHDPArea() to check the status of the Flash OB hide protection area configuration.

  * - Call HAL_FLASH_ITF_OB_SetNSecureBootAddr() to set the NSecure Flash OB boot address configuration.

  * - Call HAL_FLASH_ITF_OB_GetNSecureBootAddr() to get the NSecure Flash OB boot address configuration.

  * - Call HAL_FLASH_ITF_OB_SetSecureBootAddr() to set the Flash OB secure boot address configuration.

  * - Call HAL_FLASH_ITF_OB_GetSecureBootAddr() to get the Flash OB secure boot address configuration.

  * - Call HAL_FLASH_ITF_OB_LockBootConfig() to lock the Flash OB secure boot address configuration.

  * - Call HAL_FLASH_ITF_OB_UnlockBootConfig() to unlock the Flash OB secure boot address configuration.

  * - Call HAL_FLASH_ITF_OB_IsLockedBootConfig() to check the status of the Flash OB secure boot address configuration.

  */

#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
/**
  * @brief  Set the Flash OB secure watermark area boundaries configuration.
  * @note   To disable the secure watermark the page_nbr must be equal to zero independently of start_page.
  * @param  flash           Pointer to FLASH_TypeDef structure.
  * @param  bank            This parameter is an element of \ref hal_flash_itf_bank_t enumeration.
  * @param  start_page      Start page of the secure watermark area start boundary.
  * @param  page_nbr        Number of page(s) of the secure watermark area to be configured.
  * @retval HAL_ERROR       Flash OB write operation is already in progress.
  * @retval HAL_OK          Flash OB secure watermark area boundaries are successfully configured.
  */
hal_status_t HAL_FLASH_ITF_OB_SetSecureWMArea(FLASH_TypeDef *flash,
                                              hal_flash_itf_bank_t bank,
                                              uint32_t start_page,
                                              uint32_t page_nbr)
{
  uint32_t end_page_secwm;

  ASSERT_DBG_PARAM(flash != NULL);
  ASSERT_DBG_PARAM(IS_FLASH_ITF_BANK(bank));
  ASSERT_DBG_PARAM(start_page < FLASH_ITF_BANK_MAX_PAGE_NBR);
  ASSERT_DBG_PARAM((start_page + page_nbr) <= FLASH_ITF_BANK_MAX_PAGE_NBR);

  if (LL_FLASH_ReadFlag_SR(flash, LL_FLASH_FLAG_BSY) != 0U)
  {
    return HAL_ERROR;
  }

  if (page_nbr == 0U)
  {
    LL_FLASH_OB_BANK_ConfigSecureWMArea(flash, (uint32_t)bank, 1U, 0U);
  }
  else
  {
    end_page_secwm = start_page + page_nbr - 1U;
    LL_FLASH_OB_BANK_ConfigSecureWMArea(flash, (uint32_t)bank, start_page, end_page_secwm);
  }

  return HAL_OK;
}

/**
  * @brief  Get the Flash OB secure watermark area boundaries configuration.
  * @param  flash           Pointer to FLASH_TypeDef structure.
  * @param  bank            This parameter is an element of \ref hal_flash_itf_bank_t enumeration.
  * @param  p_start_page    Pointer to the start page of of the configured secure watermark area.
  * @param  p_page_nbr      Pointer to the number of page(s) of the configured secure watermark area.
  */
void HAL_FLASH_ITF_OB_GetSecureWMArea(const FLASH_TypeDef *flash,
                                      const hal_flash_itf_bank_t bank,
                                      uint32_t *p_start_page,
                                      uint32_t *p_page_nbr)
{
  ASSERT_DBG_PARAM(flash != NULL);
  ASSERT_DBG_PARAM(IS_FLASH_ITF_BANK(bank));
  ASSERT_DBG_PARAM(p_start_page != NULL);
  ASSERT_DBG_PARAM(p_page_nbr != NULL);

  *p_start_page = LL_FLASH_OB_BANK_GetWMAreaStartPage(flash, (uint32_t)bank);
  *p_page_nbr   = (((LL_FLASH_OB_BANK_GetWMAreaEndPage(flash, (uint32_t)bank) \
                     >> FLASH_SECWM1R1_SECWM1_PEND_Pos) - *p_start_page) + 1U);
}

/**
  * @brief  Set the Flash OB hide protection area boundaries configuration.
  * @param  flash           Pointer to FLASH_TypeDef structure.
  * @param  bank            This parameter is an element of \ref hal_flash_itf_bank_t enumeration.
  * @param  page_nbr        Number of page(s) for the hide protection area to be configured.
  * @retval HAL_OK          Flash OB hide protection area boundaries are successfully configured.
  * @retval HAL_ERROR       Flash OB write operation is already in progress.
                            Flash OB hide protection area boundaries configuration error occurred.
  */
hal_status_t HAL_FLASH_ITF_OB_SetConfigHDPArea(FLASH_TypeDef *flash,
                                               hal_flash_itf_bank_t bank,
                                               uint32_t page_nbr)
{
  uint32_t start_page_secwm;
  uint32_t end_page_secwm;
  uint32_t end_page_hdp;

  ASSERT_DBG_PARAM(flash != NULL);
  ASSERT_DBG_PARAM(IS_FLASH_ITF_BANK(bank));
  ASSERT_DBG_PARAM((page_nbr > 0U) && (page_nbr < FLASH_ITF_BANK_MAX_PAGE_NBR));

  if (LL_FLASH_ReadFlag_SR(flash, LL_FLASH_FLAG_BSY) != 0U)
  {
    return HAL_ERROR;
  }

  start_page_secwm = LL_FLASH_OB_BANK_GetWMAreaStartPage(flash, (uint32_t)bank);
  end_page_secwm = LL_FLASH_OB_BANK_GetWMAreaEndPage(flash, (uint32_t)bank);
  end_page_hdp = start_page_secwm + page_nbr - 1U;

  if (end_page_hdp > end_page_secwm)
  {
    return HAL_ERROR;
  }

  LL_FLASH_OB_BANK_SetHDPAreaEndPage(flash, (uint32_t)bank, end_page_hdp);

  return HAL_OK;
}

/**
  * @brief  Get the Flash OB hide protection area boundaries configuration.
  * @param  flash           Pointer to FLASH_TypeDef structure.
  * @param  bank            This parameter is an element of \ref hal_flash_itf_bank_t enumeration.
  * @param  p_page_nbr      Pointer to the number of page(s) of the configured hide protection area.
  */
void HAL_FLASH_ITF_OB_GetConfigHDPArea(const FLASH_TypeDef *flash,
                                       const hal_flash_itf_bank_t bank,
                                       uint32_t *p_page_nbr)
{
  uint32_t start_page;

  ASSERT_DBG_PARAM(flash != NULL);
  ASSERT_DBG_PARAM(IS_FLASH_ITF_BANK(bank));
  ASSERT_DBG_PARAM(p_page_nbr != NULL);

  start_page = LL_FLASH_OB_BANK_GetWMAreaStartPage(flash, (uint32_t)bank);
  *p_page_nbr = (((LL_FLASH_OB_BANK_GetHDPAreaEndPage(flash, ((uint32_t)bank)) \
                   >> FLASH_SECWM1R2_HDP1_PEND_Pos) - start_page) + 1U);
}

/**
  * @brief  Enable the Flash OB hide protection area configuration.
  * @param  flash           Pointer to FLASH_TypeDef structure.
  * @param  bank            This parameter is an element of \ref hal_flash_itf_bank_t enumeration.
  * @retval HAL_OK          Flash OB hide protection area is successfully enabled.
  * @retval HAL_ERROR       Flash OB write operation is already in progress.
  */
hal_status_t HAL_FLASH_ITF_OB_EnableHDPArea(FLASH_TypeDef *flash, hal_flash_itf_bank_t bank)
{
  ASSERT_DBG_PARAM(flash != NULL);
  ASSERT_DBG_PARAM(IS_FLASH_ITF_BANK(bank));

  if (LL_FLASH_ReadFlag_SR(flash, LL_FLASH_FLAG_BSY) != 0U)
  {
    return HAL_ERROR;
  }

  LL_FLASH_OB_BANK_EnableHDPArea(flash, (uint32_t)bank);

  return HAL_OK;
}

/**
  * @brief  Disable the Flash OB hide protection area configuration.
  * @param  flash           Pointer to FLASH_TypeDef structure.
  * @param  bank            This parameter is an element of \ref hal_flash_itf_bank_t enumeration.
  * @retval HAL_OK          Flash OB hide protection area is successfully disabled.
  * @retval HAL_ERROR       Flash OB write operation is already in progress.
  */
hal_status_t HAL_FLASH_ITF_OB_DisableHDPArea(FLASH_TypeDef *flash, hal_flash_itf_bank_t bank)
{
  ASSERT_DBG_PARAM(flash != NULL);
  ASSERT_DBG_PARAM(IS_FLASH_ITF_BANK(bank));

  if (LL_FLASH_ReadFlag_SR(flash, LL_FLASH_FLAG_BSY) != 0U)
  {
    return HAL_ERROR;
  }

  LL_FLASH_OB_BANK_DisableHDPArea(flash, (uint32_t)bank);

  return HAL_OK;
}

/**
  * @brief  Check if the Flash OB hide protection area configuration status.
  * @param  flash                               Pointer to FLASH_TypeDef structure.
  * @param  bank                                This parameter is an element of \ref hal_flash_itf_bank_t enumeration.
  * @retval hal_flash_itf_ob_hdp_area_status_t  Flash OB hide protection area configuration status.
  */
hal_flash_itf_ob_hdp_area_status_t HAL_FLASH_ITF_OB_IsEnabledHDPArea(const FLASH_TypeDef *flash,
                                                                     const hal_flash_itf_bank_t bank)
{
  ASSERT_DBG_PARAM(flash != NULL);
  ASSERT_DBG_PARAM(IS_FLASH_ITF_BANK(bank));

  return ((hal_flash_itf_ob_hdp_area_status_t)LL_FLASH_OB_BANK_IsEnabledHDPArea(flash, (uint32_t)bank));
}

/**
  * @brief  Set the Flash OB secure boot address 0 configuration.
  * @param  flash                Pointer to FLASH_TypeDef structure.
  * @param  boot_addr            Flash OB secure boot address 0 to be configured.
  * @retval HAL_OK               Flash OB secure boot address 0 is successfully configured.
  * @retval HAL_ERROR            Flash OB write operation is already in progress.
  */
hal_status_t HAL_FLASH_ITF_OB_SetSecureBootAddr(FLASH_TypeDef *flash, uint32_t boot_addr)
{
  ASSERT_DBG_PARAM(flash != NULL);
  ASSERT_DBG_PARAM(boot_addr != 0U);

  if (LL_FLASH_ReadFlag_SR(flash, LL_FLASH_FLAG_BSY) != 0U)
  {
    return HAL_ERROR;
  }

  LL_FLASH_OB_SetSecBootAddr0(flash, boot_addr);

  return HAL_OK;
}

/**
  * @brief  Get the Flash OB secure boot address 0 configuration.
  * @param  flash               Pointer to FLASH_TypeDef structure.
  * @retval uint32_t            Flash OB secure boot address 0 configuration.
  */
uint32_t HAL_FLASH_ITF_OB_GetSecureBootAddr(const FLASH_TypeDef *flash)
{
  ASSERT_DBG_PARAM(flash != NULL);

  return LL_FLASH_OB_GetSecBootAddr0(flash);
}

/**
  * @brief  Lock the Flash OB secure boot address configuration.
  * @param  flash             Pointer to FLASH_TypeDef structure.
  * @retval HAL_OK            Flash OB boot address configuration is successfully locked.
  * @retval HAL_ERROR         Flash OB write operation is already in progress.
  */
hal_status_t HAL_FLASH_ITF_OB_LockBootConfig(FLASH_TypeDef *flash)
{
  ASSERT_DBG_PARAM(flash != NULL);

  if (LL_FLASH_ReadFlag_SR(flash, LL_FLASH_FLAG_BSY) != 0U)
  {
    return HAL_ERROR;
  }

  LL_FLASH_OB_LockBootConfiguration(flash);

  return HAL_OK;
}

/**
  * @brief  Unlock the Flash OB secure boot address configuration.
  * @param  flash             Pointer to FLASH_TypeDef structure.
  * @retval HAL_OK            Flash OB boot address configuration is successfully unlocked.
  * @retval HAL_ERROR         Flash OB write operation is already in progress.
  */
hal_status_t HAL_FLASH_ITF_OB_UnlockBootConfig(FLASH_TypeDef *flash)
{
  ASSERT_DBG_PARAM(flash != NULL);

  if (LL_FLASH_ReadFlag_SR(flash, LL_FLASH_FLAG_BSY) != 0U)
  {
    return HAL_ERROR;
  }

  LL_FLASH_OB_UnlockBootConfiguration(flash);

  return HAL_OK;
}

/**
  * @brief  Check the Flash OB secure boot configuration status.
  * @param  flash                                          Pointer to FLASH_TypeDef structure.
  * @retval hal_flash_itf_ob_boot_lock_status_t            Flash OB secure boot configuration is locked or unlocked.
  */
hal_flash_itf_ob_boot_lock_status_t HAL_FLASH_ITF_OB_IsLockedBootConfig(const FLASH_TypeDef *flash)
{
  ASSERT_DBG_PARAM(flash != NULL);

  return ((hal_flash_itf_ob_boot_lock_status_t)LL_FLASH_OB_IsLockedBootConfiguration(flash));
}
#endif /* __ARM_FEATURE_CMSE */

/**
  * @brief  Set the Flash OB write protection area boundaries configuration.
  * @note   To disable the write protection area the page_nbr must be equal to zero independently of start_page.
  * @param  flash           Pointer to FLASH_TypeDef structure.
  * @param  bank            This parameter is an element of \ref hal_flash_itf_bank_t enumeration.
  * @param  area            This parameter is an element of \ref hal_flash_itf_ob_bank_area_t enumeration.
  * @param  start_page      Start page for the write protection area start boundary.
  * @param  page_nbr        End page for the write protection area end boundary.
  * @retval HAL_OK          Flash OB write protection area boundaries are successfully configured.
  * @retval HAL_ERROR       Flash OB write operation is already in progress.
  */
hal_status_t HAL_FLASH_ITF_OB_SetWRPArea(FLASH_TypeDef *flash,
                                         hal_flash_itf_bank_t bank,
                                         hal_flash_itf_ob_bank_area_t area,
                                         uint32_t start_page,
                                         uint32_t page_nbr)
{
  uint32_t end_page_wrp;

