STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_hal_flash_itf.c
  ASSERT_DBG_PARAM(flash != NULL);
  ASSERT_DBG_PARAM(IS_FLASH_ITF_BANK(bank));
  ASSERT_DBG_PARAM(IS_FLASH_ITF_OB_BANK_AREA(area));
  ASSERT_DBG_PARAM(start_page < FLASH_ITF_BANK_MAX_PAGE_NBR);
  ASSERT_DBG_PARAM((start_page + page_nbr) <= FLASH_ITF_BANK_MAX_PAGE_NBR);

  if (LL_FLASH_ReadFlag_SR(flash, LL_FLASH_FLAG_BSY) != 0U)
  {
    return HAL_ERROR;
  }

  if (page_nbr == 0U)
  {
    LL_FLASH_OB_BANK_ConfigAreaWRP(flash, (uint32_t)bank, (uint32_t)area, 1U, 0U);
  }
  else
  {
    end_page_wrp = start_page + page_nbr - 1U;
    LL_FLASH_OB_BANK_ConfigAreaWRP(flash, (uint32_t)bank, (uint32_t)area, start_page, end_page_wrp);
  }

  return HAL_OK;
}

/**
  * @brief  Get the Flash OB write protection area boundaries configuration.
  * @param  flash           Pointer to FLASH_TypeDef structure.
  * @param  bank            This parameter is an element of \ref hal_flash_itf_bank_t enumeration.
  * @param  area            This parameter is an element of \ref hal_flash_itf_ob_bank_area_t enumeration.
  * @param  p_start_page    Pointer to the write protection area start boundary.
  * @param  p_page_nbr      Pointer to the number of page(s) of the write protection area to be configured.
  */
void HAL_FLASH_ITF_OB_GetWRPArea(const FLASH_TypeDef *flash,
                                 const hal_flash_itf_bank_t bank,
                                 const hal_flash_itf_ob_bank_area_t area,
                                 uint32_t *p_start_page,
                                 uint32_t *p_page_nbr)
{
  ASSERT_DBG_PARAM(flash != NULL);
  ASSERT_DBG_PARAM(IS_FLASH_ITF_BANK(bank));
  ASSERT_DBG_PARAM(IS_FLASH_ITF_OB_BANK_AREA(area));
  ASSERT_DBG_PARAM(p_start_page != NULL);
  ASSERT_DBG_PARAM(p_page_nbr != NULL);

  *p_start_page = LL_FLASH_OB_BANK_GetAreaWRPStartPage(flash, (uint32_t)bank, (uint32_t)area);
  *p_page_nbr   = (((LL_FLASH_OB_BANK_GetAreaWRPEndPage(flash, (uint32_t)bank,
                                                        (uint32_t)area) >> FLASH_WRP1AR_WRP1A_PEND_Pos) - \
                    *p_start_page) + 1U);
}

/**
  * @brief  Lock the Flash OB write protection area configuration.
  * @param  flash           Pointer to FLASH_TypeDef structure.
  * @param  bank            This parameter is an element of \ref hal_flash_itf_bank_t enumeration.
  * @param  area            This parameter is an element of \ref hal_flash_itf_ob_bank_area_t enumeration.
  * @retval HAL_OK          Flash OB write protection area configuration is successfully locked.
  * @retval HAL_ERROR       Flash OB write operation is already in progress.
  */
hal_status_t HAL_FLASH_ITF_OB_LockWRPAreaConfig(FLASH_TypeDef *flash,
                                                hal_flash_itf_bank_t bank,
                                                hal_flash_itf_ob_bank_area_t area)
{
  ASSERT_DBG_PARAM(flash != NULL);
  ASSERT_DBG_PARAM(IS_FLASH_ITF_BANK(bank));
  ASSERT_DBG_PARAM(IS_FLASH_ITF_OB_BANK_AREA(area));

  if (LL_FLASH_ReadFlag_SR(flash, LL_FLASH_FLAG_BSY) != 0U)
  {
    return HAL_ERROR;
  }

  LL_FLASH_OB_BANK_LockAreaWRP(flash, (uint32_t)bank, (uint32_t)area);

  return HAL_OK;
}

/**
  * @brief  Unlock the Flash OB write protection area configuration.
  * @param  flash           Pointer to FLASH_TypeDef structure.
  * @param  bank            This parameter is an element of \ref hal_flash_itf_bank_t enumeration.
  * @param  area            This parameter is an element of \ref hal_flash_itf_ob_bank_area_t enumeration.
  * @retval HAL_OK          Flash OB write protection area configuration is successfully unlocked.
  * @retval HAL_ERROR       Flash OB write operation is already in progress.
  */
hal_status_t HAL_FLASH_ITF_OB_UnlockWRPAreaConfig(FLASH_TypeDef *flash,
                                                  hal_flash_itf_bank_t bank,
                                                  hal_flash_itf_ob_bank_area_t area)
{
  ASSERT_DBG_PARAM(flash != NULL);
  ASSERT_DBG_PARAM(IS_FLASH_ITF_BANK(bank));
  ASSERT_DBG_PARAM(IS_FLASH_ITF_OB_BANK_AREA(area));

  if (LL_FLASH_ReadFlag_SR(flash, LL_FLASH_FLAG_BSY) != 0U)
  {
    return HAL_ERROR;
  }

  LL_FLASH_OB_BANK_UnlockAreaWRP(flash, (uint32_t)bank, (uint32_t)area);

  return HAL_OK;
}

/**
  * @brief  Check if the Flash OB write protection area configuration lock status.
  * @param  flash                               Pointer to FLASH_TypeDef structure.
  * @param  bank                                This parameter is an element of \ref hal_flash_itf_bank_t enumeration.
  * @param  area                                This parameter is an element of \ref hal_flash_itf_ob_bank_area_t
                                                enumeration.
  * @retval hal_flash_itf_ob_wrp_lock_status_t  Flash OB write protection area configuration is locked or unlocked.
  */
hal_flash_itf_ob_wrp_lock_status_t HAL_FLASH_ITF_OB_IsLockedWRPAreaConfig(const FLASH_TypeDef *flash,
                                                                          const hal_flash_itf_bank_t bank,
                                                                          const hal_flash_itf_ob_bank_area_t area)
{
  ASSERT_DBG_PARAM(flash != NULL);
  ASSERT_DBG_PARAM(IS_FLASH_ITF_BANK(bank));
  ASSERT_DBG_PARAM(IS_FLASH_ITF_OB_BANK_AREA(area));

  return ((hal_flash_itf_ob_wrp_lock_status_t)LL_FLASH_OB_BANK_IsLockedAreaWRP(flash, (uint32_t)bank, (uint32_t)area));
}

/**
  * @brief  Set the Flash OB readout protection level.
  * @param  flash                Pointer to FLASH_TypeDef structure.
  * @param  rdp_level            This parameter is an element of \ref hal_flash_itf_ob_rdp_level_t enumeration.
  * @retval HAL_OK               Flash OB readout protection level is successfully configured.
  * @retval HAL_ERROR            Flash OB write operation is already in progress.
  */
hal_status_t HAL_FLASH_ITF_OB_SetRDPLevel(FLASH_TypeDef *flash, hal_flash_itf_ob_rdp_level_t rdp_level)
{
  ASSERT_DBG_PARAM(flash != NULL);
  ASSERT_DBG_PARAM(IS_FLASH_ITF_OB_RDP_LEVEL(rdp_level));

  if (LL_FLASH_ReadFlag_SR(flash, LL_FLASH_FLAG_BSY) != 0U)
  {
    return HAL_ERROR;
  }

  LL_FLASH_OB_SetRDPLevel(flash, (uint32_t)rdp_level);

  return HAL_OK;
}

/**
  * @brief  Get the Flash OB readout protection level.
  * @param  flash                         Pointer to FLASH_TypeDef structure.
  * @retval hal_flash_itf_ob_rdp_level_t  Flash OB readout protection level.
  */
hal_flash_itf_ob_rdp_level_t HAL_FLASH_ITF_OB_GetRDPLevel(const FLASH_TypeDef *flash)
{
  ASSERT_DBG_PARAM(flash != NULL);

  return ((hal_flash_itf_ob_rdp_level_t)LL_FLASH_OB_GetRDPLevel(flash));
}

/**
  * @brief  Set the Flash OB readout protection OEM1 key.
  * @param  flash                  Pointer to FLASH_TypeDef structure.
  * @param  p_key                  Pointer to Flash OB Readout Protection OEM key structure
  * @retval HAL_OK                 Flash OB readout protection OEM1 key is successfully configured.
  * @retval HAL_ERROR              Flash OB write operation is already in progress.
  */
hal_status_t HAL_FLASH_ITF_OB_SetRDPOEM1Key(FLASH_TypeDef *flash, hal_flash_itf_ob_rdp_oem_key_t *p_key)
{
  ASSERT_DBG_PARAM(flash != NULL);
  ASSERT_DBG_PARAM(p_key != NULL);

  if (LL_FLASH_ReadFlag_SR(flash, LL_FLASH_FLAG_BSY) != 0U)
  {
    return HAL_ERROR;
  }

  LL_FLASH_SetOEM1KeyLowBytes(flash, p_key ->key_w1);
  LL_FLASH_SetOEM1KeyHighBytes(flash, p_key ->key_w2);

  return HAL_OK;
}

/**
  * @brief  Set the Flash OB readout protection OEM2 key.
  * @param  flash                  Pointer to FLASH_TypeDef structure.
  * @param  p_key                  Pointer to Flash OB Readout Protection OEM key structure
  * @retval HAL_OK                 Flash OB readout protection OEM2 key is successfully configured.
  * @retval HAL_ERROR              Flash OB write operation is already in progress.
  */
hal_status_t HAL_FLASH_ITF_OB_SetRDPOEM2Key(FLASH_TypeDef *flash, hal_flash_itf_ob_rdp_oem_key_t *p_key)
{
  ASSERT_DBG_PARAM(flash != NULL);
  ASSERT_DBG_PARAM(p_key != NULL);

  if (LL_FLASH_ReadFlag_SR(flash, LL_FLASH_FLAG_BSY) != 0U)
  {
    return HAL_ERROR;
  }

  LL_FLASH_SetOEM2KeyLowBytes(flash, p_key ->key_w1);
  LL_FLASH_SetOEM2KeyHighBytes(flash, p_key ->key_w2);

  return HAL_OK;
}

/**
  * @brief  Set the Flash OB BOR level value.
  * @param  flash                Pointer to FLASH_TypeDef structure.
  * @param  bor_level            This parameter is an element of \ref hal_flash_itf_ob_bor_level_t enumeration.
  * @retval HAL_OK               Flash OB BOR level value is successfully configured.
  * @retval HAL_ERROR            Flash OB write operation is already in progress.
  */
hal_status_t HAL_FLASH_ITF_OB_SetBORLevel(FLASH_TypeDef *flash, hal_flash_itf_ob_bor_level_t bor_level)
{
  ASSERT_DBG_PARAM(flash != NULL);
  ASSERT_DBG_PARAM(IS_FLASH_ITF_OB_BOR_LEVEL(bor_level));

  if (LL_FLASH_ReadFlag_SR(flash, LL_FLASH_FLAG_BSY) != 0U)
  {
    return HAL_ERROR;
  }

  LL_FLASH_OB_SetBORLevel(flash, (uint32_t)bor_level);

  return HAL_OK;
}

/**
  * @brief  Get the Flash OB BOR level value.
  * @param  flash                         Pointer to FLASH_TypeDef structure.
  * @retval hal_flash_itf_ob_bor_level_t  Flash OB BOR level value.
  */
hal_flash_itf_ob_bor_level_t HAL_FLASH_ITF_OB_GetBORLevel(const FLASH_TypeDef *flash)
{
  ASSERT_DBG_PARAM(flash != NULL);

  return ((hal_flash_itf_ob_bor_level_t)((uint32_t)LL_FLASH_OB_GetBORLevel(flash)));
}

/**
  * @brief  Set the Flash OB low power mode reset generation configuration.
  * @param  flash                   Pointer to FLASH_TypeDef structure.
  * @param  low_pwr_mode            Flash OB Low power mode selection.
  * @param  rst_gen                 Element from the \ref hal_flash_itf_ob_rst_generation_status_t enumeration.
  * @retval HAL_OK                  Flash OB low power mode reset generation is successfully configured.
  * @retval HAL_ERROR               Flash OB write operation is already in progress.
  */
hal_status_t HAL_FLASH_ITF_OB_SetEnterLowPWRModeRstGeneration(FLASH_TypeDef *flash,
                                                              uint32_t low_pwr_mode,
                                                              hal_flash_itf_ob_rst_generation_status_t rst_gen)
{
  ASSERT_DBG_PARAM(flash != NULL);
  ASSERT_DBG_PARAM((low_pwr_mode & FLASH_ITF_OB_LOW_PWR_MSK) == low_pwr_mode);
  ASSERT_DBG_PARAM(IS_FLASH_OB_RST_GENERATION(rst_gen));

  if (LL_FLASH_ReadFlag_SR(flash, LL_FLASH_FLAG_BSY) != 0U)
  {
    return HAL_ERROR;
  }

  if ((low_pwr_mode & HAL_FLASH_ITF_OB_STOP_MODE) == HAL_FLASH_ITF_OB_STOP_MODE)
  {
    LL_FLASH_OB_SetNRSTStopMode(flash, (uint32_t)rst_gen * LL_FLASH_OB_NO_RST_STOP_MODE);
  }

  if ((low_pwr_mode & HAL_FLASH_ITF_OB_STANDBY_MODE) == HAL_FLASH_ITF_OB_STANDBY_MODE)
  {
    LL_FLASH_OB_SetNRSTStandbyMode(flash, (uint32_t)rst_gen * LL_FLASH_OB_NO_RST_STDBY_MODE);
  }

  if ((low_pwr_mode & HAL_FLASH_ITF_OB_SHUTDOWN_MODE) == HAL_FLASH_ITF_OB_SHUTDOWN_MODE)
  {
    LL_FLASH_OB_SetNRSTShutdownMode(flash, (uint32_t)rst_gen * LL_FLASH_OB_NO_RST_SHDW_MODE);
  }

  return HAL_OK;
}

/**
  * @brief  Get the Flash OB low power reset generation configuration.
  * @param  flash                                     Pointer to FLASH_TypeDef structure.
  * @param  low_pwr_mode                              Flash OB low power mode selection.
  * @retval hal_flash_itf_ob_rst_generation_status_t  Flash OB low power mode reset generation configuration.
  */
hal_flash_itf_ob_rst_generation_status_t HAL_FLASH_ITF_OB_GetEnterLowPWRModeRstGeneration(const FLASH_TypeDef *flash,
    uint32_t low_pwr_mode)
{
  ASSERT_DBG_PARAM(flash != NULL);
  ASSERT_DBG_PARAM(IS_FLASH_ITF_OB_LOW_PWR_MODE(low_pwr_mode));

  if (low_pwr_mode == HAL_FLASH_ITF_OB_STOP_MODE)
  {
    return (hal_flash_itf_ob_rst_generation_status_t)
           ((uint32_t)(LL_FLASH_OB_GetNRSTStopMode(flash) >> FLASH_OPTR_nRST_STOP_Pos));
  }
  else if (low_pwr_mode == HAL_FLASH_ITF_OB_STANDBY_MODE)
  {
    return (hal_flash_itf_ob_rst_generation_status_t)
           ((uint32_t)(LL_FLASH_OB_GetNRSTStandbyMode(flash) >> FLASH_OPTR_nRST_STDBY_Pos));
  }
  else
  {
    return (hal_flash_itf_ob_rst_generation_status_t)
           ((uint32_t)(LL_FLASH_OB_GetNRSTShutdownMode(flash) >> FLASH_OPTR_nRST_SHDW_Pos));
  }
}

/**
  * @brief  Set the Flash OB system reset SRAM erase configuration.
  * @param  flash           Pointer to FLASH_TypeDef structure.
  * @param  sram            Flash OB SRAM selection.
  * @param  sram_erase      Element from the \ref hal_flash_itf_ob_sys_rst_sram_erase_t enumeration.
  * @retval HAL_OK          Flash OB SRAM erase memories is successfully configured.
  * @retval HAL_ERROR       Flash OB write operation is already in progress.
  */
hal_status_t HAL_FLASH_ITF_OB_SetSystemRstSRAMErase(FLASH_TypeDef *flash,
                                                    uint32_t sram,
                                                    hal_flash_itf_ob_sys_rst_sram_erase_t sram_erase)
{
  ASSERT_DBG_PARAM(flash != NULL);
  ASSERT_DBG_PARAM((sram & FLASH_ITF_OB_SRAM_ERASE_MSK) == sram);
  ASSERT_DBG_PARAM(IS_FLASH_ITF_OB_SYS_RST_SRAM_ERASE(sram_erase));

  if (LL_FLASH_ReadFlag_SR(flash, LL_FLASH_FLAG_BSY) != 0U)
  {
    return HAL_ERROR;
  }

  if ((sram & HAL_FLASH_ITF_OB_SRAM2) == HAL_FLASH_ITF_OB_SRAM2)
  {
    LL_FLASH_OB_SetSystemRstSRAM2Erase(flash, (uint32_t)sram_erase * LL_FLASH_OB_NOT_ERASED_SRAM2_SYS_RST);
  }

