STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_hal_flash_itf.c
  if ((sram & HAL_FLASH_ITF_OB_SRAM) == HAL_FLASH_ITF_OB_SRAM)
  {
    LL_FLASH_OB_SetSystemRstSRAMErase(flash, (uint32_t)sram_erase * LL_FLASH_OB_NOT_ERASED_SRAM_SYS_RST);
  }

  return HAL_OK;
}

/**
  * @brief  Get the Flash OB system reset SRAM erase configuration.
  * @param  flash                                     Pointer to FLASH_TypeDef structure.
  * @param  sram                                      Flash OB SRAM selection.
  * @retval hal_flash_itf_ob_sys_rst_sram_erase_t     Flash OB system reset SRAM erase configuration.
  */
hal_flash_itf_ob_sys_rst_sram_erase_t HAL_FLASH_ITF_OB_GetSystemRstSRAMErase(const FLASH_TypeDef *flash, uint32_t sram)
{
  ASSERT_DBG_PARAM(flash != NULL);
  ASSERT_DBG_PARAM(IS_FLASH_ITF_OB_SRAM_ERASE(sram));

  if (sram == HAL_FLASH_ITF_OB_SRAM2)
  {
    return (hal_flash_itf_ob_sys_rst_sram_erase_t)
           ((uint32_t)(LL_FLASH_OB_GetSystemRstSRAM2Erase(flash) >> FLASH_OPTR_SRAM2_RST_Pos));
  }
  else
  {
    return (hal_flash_itf_ob_sys_rst_sram_erase_t)
           ((uint32_t)(LL_FLASH_OB_GetSystemRstSRAMErase(flash) >> FLASH_OPTR_SRAM_RST_Pos));
  }
}

/**
  * @brief  Set the Flash OB IWDG mode selection.
  * @param  flash           Pointer to FLASH_TypeDef structure.
  * @param  mode            Element from the \ref hal_flash_itf_ob_wdg_mode_t enumeration.
  * @retval HAL_OK          Flash OB IWDG mode selection is successfully configured.
  * @retval HAL_ERROR       Flash OB write operation is already in progress.
  */
hal_status_t HAL_FLASH_ITF_OB_SetIWDGMode(FLASH_TypeDef *flash, hal_flash_itf_ob_wdg_mode_t mode)
{
  ASSERT_DBG_PARAM(flash != NULL);
  ASSERT_DBG_PARAM(IS_FLASH_ITF_OB_WDG_HW_SW_MODE(mode));

  if (LL_FLASH_ReadFlag_SR(flash, LL_FLASH_FLAG_BSY) != 0U)
  {
    return HAL_ERROR;
  }

  LL_FLASH_OB_SetIWDGSelection(flash, (uint32_t)mode * LL_FLASH_OB_IWDG_SW);

  return HAL_OK;
}

/**
  * @brief  Get the Flash OB IWDG mode selection.
  * @param  flash                                  Pointer to FLASH_TypeDef structure.
  * @retval hal_flash_itf_ob_wdg_mode_t            Flash OB IWDG mode selection.
  */
hal_flash_itf_ob_wdg_mode_t HAL_FLASH_ITF_OB_GetIWDGMode(const FLASH_TypeDef *flash)
{
  ASSERT_DBG_PARAM(flash != NULL);

  return (hal_flash_itf_ob_wdg_mode_t)((uint32_t)(LL_FLASH_OB_GetIWDGSelection(flash) >> FLASH_OPTR_IWDG_SW_Pos));
}

/**
  * @brief  Set the Flash OB WWDG mode selection.
  * @param  flash           Pointer to FLASH_TypeDef structure.
  * @param  mode            Element from the \ref hal_flash_itf_ob_wdg_mode_t enumeration.
  * @retval HAL_OK          Flash OB WWDG mode selection is successfully configured.
  * @retval HAL_ERROR       Flash OB write operation is already in progress.
  */
hal_status_t HAL_FLASH_ITF_OB_SetWWDGMode(FLASH_TypeDef *flash, hal_flash_itf_ob_wdg_mode_t mode)
{
  ASSERT_DBG_PARAM(flash != NULL);
  ASSERT_DBG_PARAM(IS_FLASH_ITF_OB_WDG_HW_SW_MODE(mode));

  if (LL_FLASH_ReadFlag_SR(flash, LL_FLASH_FLAG_BSY) != 0U)
  {
    return HAL_ERROR;
  }

  LL_FLASH_OB_SetWWDGSelection(flash, (uint32_t)mode * LL_FLASH_OB_WWDG_SW);

  return HAL_OK;
}

/**
  * @brief  Get the Flash OB WWDG mode selection.
  * @param  flash                                  Pointer to FLASH_TypeDef structure.
  * @retval hal_flash_itf_ob_wdg_mode_t            Flash OB WWDG mode selection.
  */
hal_flash_itf_ob_wdg_mode_t HAL_FLASH_ITF_OB_GetWWDGMode(const FLASH_TypeDef *flash)
{
  ASSERT_DBG_PARAM(flash != NULL);

  return (hal_flash_itf_ob_wdg_mode_t)((uint32_t)(LL_FLASH_OB_GetWWDGSelection(flash) >> FLASH_OPTR_WWDG_SW_Pos));
}

/**
  * @brief  Freeze the Flash OB IWDG low power mode counter configuration.
  * @param  flash           Pointer to FLASH_TypeDef structure.
  * @param  low_pwr_mode    Flash OB low power mode selection.
  * @retval HAL_OK          Flash OB IWDG low power counter is frozen.
  * @retval HAL_ERROR       Flash OB write operation is already in progress.
  */
hal_status_t HAL_FLASH_ITF_OB_FreezeIWDGCounterLowPWRMode(FLASH_TypeDef *flash, uint32_t low_pwr_mode)
{
  ASSERT_DBG_PARAM(flash != NULL);
  ASSERT_DBG_PARAM((low_pwr_mode & FLASH_ITF_OB_LOW_PWR_MSK) == low_pwr_mode);
  ASSERT_DBG_PARAM((low_pwr_mode & HAL_FLASH_ITF_OB_SHUTDOWN_MODE) == 0U);

  if (LL_FLASH_ReadFlag_SR(flash, LL_FLASH_FLAG_BSY) != 0U)
  {
    return HAL_ERROR;
  }

  if ((low_pwr_mode & HAL_FLASH_ITF_OB_STOP_MODE) == HAL_FLASH_ITF_OB_STOP_MODE)
  {
    LL_FLASH_OB_FreezeIWDGStopMode(flash);
  }

  if ((low_pwr_mode & HAL_FLASH_ITF_OB_STANDBY_MODE) == HAL_FLASH_ITF_OB_STANDBY_MODE)
  {
    LL_FLASH_OB_FreezeIWDGStandbyMode(flash);
  }

  return HAL_OK;
}

/**
  * @brief  Unfreeze the Flash OB IWDG low power counter configuration.
  * @param  flash           Pointer to FLASH_TypeDef structure.
  * @param  low_pwr_mode    low power mode selection.
  * @retval HAL_OK          Flash OB IWDG low power mode counter is unfrozen.
  * @retval HAL_ERROR       Flash OB write operation is already in progress.
  */
hal_status_t HAL_FLASH_ITF_OB_UnfreezeIWDGCounterLowPWRMode(FLASH_TypeDef *flash, uint32_t low_pwr_mode)
{
  ASSERT_DBG_PARAM(flash != NULL);
  ASSERT_DBG_PARAM((low_pwr_mode & FLASH_ITF_OB_LOW_PWR_MSK) == low_pwr_mode);
  ASSERT_DBG_PARAM((low_pwr_mode & HAL_FLASH_ITF_OB_SHUTDOWN_MODE) == 0U);

  if (LL_FLASH_ReadFlag_SR(flash, LL_FLASH_FLAG_BSY) != 0U)
  {
    return HAL_ERROR;
  }

  if ((low_pwr_mode & HAL_FLASH_ITF_OB_STOP_MODE) == HAL_FLASH_ITF_OB_STOP_MODE)
  {
    LL_FLASH_OB_UnfreezeIWDGStopMode(flash);
  }

  if ((low_pwr_mode & HAL_FLASH_ITF_OB_STANDBY_MODE) == HAL_FLASH_ITF_OB_STANDBY_MODE)
  {
    LL_FLASH_OB_UnfreezeIWDGStandbyMode(flash);
  }

  return HAL_OK;
}

/**
  * @brief  Check the Flash OB IWDG low power mode counter freeze configuration status.
  * @param  flash                                 Pointer to FLASH_TypeDef structure.
  * @param  low_pwr_mode                          Flash OB low power mode selection.
  * @retval hal_flash_itf_ob_wdg_freeze_status_t  Flash OB IWDG low power mode counter freeze configuration status.
  */
hal_flash_itf_ob_wdg_freeze_status_t HAL_FLASH_ITF_OB_IsFrozenIWDGCounterLowPWRMode(const FLASH_TypeDef *flash,
    uint32_t low_pwr_mode)
{
  ASSERT_DBG_PARAM(flash != NULL);
  ASSERT_DBG_PARAM(IS_FLASH_ITF_OB_LOW_PWR_MODE(low_pwr_mode));
  ASSERT_DBG_PARAM((low_pwr_mode & HAL_FLASH_ITF_OB_SHUTDOWN_MODE) == 0U);

  if (low_pwr_mode == HAL_FLASH_ITF_OB_STOP_MODE)
  {
    return (hal_flash_itf_ob_wdg_freeze_status_t)LL_FLASH_OB_IsFrozenIWDGStopMode(flash);
  }
  else
  {
    return (hal_flash_itf_ob_wdg_freeze_status_t)LL_FLASH_OB_IsFrozenIWDGStandbyMode(flash);
  }
}

/**
  * @brief  Set the Flash OB bank swapping configuration.
  * @param  flash                Pointer to FLASH_TypeDef structure.
  * @param  bank_swap            This parameter is an element of \ref hal_flash_itf_ob_bank_swap_t enumeration.
  * @retval HAL_OK               Flash OB bank swapping is successfully configured.
  * @retval HAL_ERROR            Flash OB write operation is already in progress.
  */
hal_status_t HAL_FLASH_ITF_OB_SetBankSwap(FLASH_TypeDef *flash, hal_flash_itf_ob_bank_swap_t bank_swap)
{
  ASSERT_DBG_PARAM(flash != NULL);
  ASSERT_DBG_PARAM(IS_FLASH_ITF_OB_SWAP_BANK(bank_swap));

  if (LL_FLASH_ReadFlag_SR(flash, LL_FLASH_FLAG_BSY) != 0U)
  {
    return HAL_ERROR;
  }

  LL_FLASH_OB_SetSwapBanks(flash, (uint32_t)bank_swap);

  return HAL_OK;
}

/**
  * @brief  Get the Flash OB bank swapping configuration.
  * @param  flash                                   Pointer to FLASH_TypeDef structure.
  * @retval hal_flash_itf_ob_bank_swap_t            Flash OB bank swapping configuration.
  */
hal_flash_itf_ob_bank_swap_t HAL_FLASH_ITF_OB_GetBankSwap(const FLASH_TypeDef *flash)
{
  ASSERT_DBG_PARAM(flash != NULL);

