STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_hal_flash_itf.c
  return ((hal_flash_itf_ob_bank_swap_t)LL_FLASH_OB_GetSwapBanks(flash));
}

/**
  * @brief  Set the Flash OB bank topology configuration.
  * @param  flash                    Pointer to FLASH_TypeDef structure.
  * @param  bank_topology            This parameter is an element of \ref hal_flash_itf_ob_topology_t enumeration.
  * @retval HAL_OK                   Flash OB single/dual bank topology is successfully configured.
  * @retval HAL_ERROR                Flash OB write operation is already in progress.
  */
hal_status_t HAL_FLASH_ITF_OB_SetBankTopology(FLASH_TypeDef *flash, hal_flash_itf_ob_topology_t bank_topology)
{
  ASSERT_DBG_PARAM(flash != NULL);
  ASSERT_DBG_PARAM(IS_FLASH_ITF_OB_SINGLE_DUAL_BANK(bank_topology));

  if (LL_FLASH_ReadFlag_SR(flash, LL_FLASH_FLAG_BSY) != 0U)
  {
    return HAL_ERROR;
  }

  LL_FLASH_OB_SetBank(flash, (uint32_t)bank_topology);

  return HAL_OK;
}

/**
  * @brief  Get the Flash OB bank topology configuration.
  * @param  flash                                  Pointer to FLASH_TypeDef structure.
  * @retval hal_flash_itf_ob_topology_t            Flash OB single/dual bank topology configuration.
  */
hal_flash_itf_ob_topology_t HAL_FLASH_ITF_OB_GetBankTopology(const FLASH_TypeDef *flash)
{
  ASSERT_DBG_PARAM(flash != NULL);

  return ((hal_flash_itf_ob_topology_t)LL_FLASH_OB_GetBank(flash));
}

/**
  * @brief  Enable the Flash OB BKPRAM ECC configuration.
  * @param  flash           Pointer to FLASH_TypeDef structure.
  * @param  sram            Flash OB SRAM selection.
  * @retval HAL_OK          Flash OB SRAM ECC is successfully enabled.
  * @retval HAL_ERROR       Flash OB write operation is already in progress.
  */
hal_status_t HAL_FLASH_ITF_OB_EnableSRAMECC(FLASH_TypeDef *flash, uint32_t sram)
{
  ASSERT_DBG_PARAM(flash != NULL);
  ASSERT_DBG_PARAM((sram & FLASH_ITF_OB_SRAM_ECC_MSK) == sram);

  if (LL_FLASH_ReadFlag_SR(flash, LL_FLASH_FLAG_BSY) != 0U)
  {
    return HAL_ERROR;
  }

  if ((sram & HAL_FLASH_ITF_OB_BKPRAM) == HAL_FLASH_ITF_OB_BKPRAM)
  {
    LL_FLASH_OB_EnableECCBKPRAM(flash);
  }

  if ((sram & HAL_FLASH_ITF_OB_SRAM2) == HAL_FLASH_ITF_OB_SRAM2)
  {
    LL_FLASH_OB_EnableECCSRAM2(flash);
  }
#if defined (SRAM3_BASE)
  if ((sram & HAL_FLASH_ITF_OB_SRAM3) == HAL_FLASH_ITF_OB_SRAM3)
  {
    LL_FLASH_OB_EnableECCSRAM3(flash);
  }
#endif /* SRAM3_BASE */
  return HAL_OK;
}

/**
  * @brief  Disable the Flash OB SRAM ECC configuration.
  * @param  flash           Pointer to FLASH_TypeDef structure.
  * @param  sram            Flash OB SRAM selection.
  * @retval HAL_OK          Flash OB SRAM ECC is successfully disabled.
  * @retval HAL_ERROR       Flash OB write operation is already in progress.
  */
hal_status_t HAL_FLASH_ITF_OB_DisableSRAMECC(FLASH_TypeDef *flash, uint32_t sram)
{
  ASSERT_DBG_PARAM(flash != NULL);
  ASSERT_DBG_PARAM((sram & FLASH_ITF_OB_SRAM_ECC_MSK) == sram);

  if (LL_FLASH_ReadFlag_SR(flash, LL_FLASH_FLAG_BSY) != 0U)
  {
    return HAL_ERROR;
  }

  if ((sram & HAL_FLASH_ITF_OB_BKPRAM) == HAL_FLASH_ITF_OB_BKPRAM)
  {
    LL_FLASH_OB_DisableECCBKPRAM(flash);
  }

  if ((sram & HAL_FLASH_ITF_OB_SRAM2) == HAL_FLASH_ITF_OB_SRAM2)
  {
    LL_FLASH_OB_DisableECCSRAM2(flash);
  }
#if defined (SRAM3_BASE)
  if ((sram & HAL_FLASH_ITF_OB_SRAM3) == HAL_FLASH_ITF_OB_SRAM3)
  {
    LL_FLASH_OB_DisableECCSRAM3(flash);
  }
#endif /* SRAM3_BASE */
  return HAL_OK;
}

/**
  * @brief  Check the Flash OB SRAM ECC configuration status.
  * @param  flash                               Pointer to FLASH_TypeDef structure.
  * @param  sram                                Flash OB SRAM selection.
  * @retval hal_flash_itf_ob_sram_ecc_status_t  Flash OB SRAM ECC configuration status.
  */
hal_flash_itf_ob_sram_ecc_status_t HAL_FLASH_ITF_OB_IsEnabledSRAMECC(const FLASH_TypeDef *flash, uint32_t sram)
{
  ASSERT_DBG_PARAM(flash != NULL);
  ASSERT_DBG_PARAM(IS_FLASH_ITF_OB_SRAM_ECC(sram));

  if (sram == HAL_FLASH_ITF_OB_BKPRAM)
  {
    return (hal_flash_itf_ob_sram_ecc_status_t)LL_FLASH_OB_IsEnabledECCBKPRAM(flash);
  }
#if defined (SRAM3_BASE)
  else if (sram == HAL_FLASH_ITF_OB_SRAM3)
  {
    return (hal_flash_itf_ob_sram_ecc_status_t)LL_FLASH_OB_IsEnabledECCSRAM3(flash);
  }
#endif /* SRAM3_BASE */
  else
  {
    return (hal_flash_itf_ob_sram_ecc_status_t)LL_FLASH_OB_IsEnabledECCSRAM2(flash);
  }
}

/**
  * @brief  Set the Flash OB Software boot0 selection.
  * @param  flash                      Pointer to FLASH_TypeDef structure.
  * @param  boot_select                Element from \ref hal_flash_itf_ob_boot_selection_t enumeration.
  * @retval HAL_OK                     Flash OB Software boot0 selection is successfully configured.
  * @retval HAL_ERROR                  Flash OB write operation is already in progress.
  */
hal_status_t HAL_FLASH_ITF_OB_SetBootSelection(FLASH_TypeDef *flash, hal_flash_itf_ob_boot_selection_t boot_select)
{
  ASSERT_DBG_PARAM(flash != NULL);
  ASSERT_DBG_PARAM(IS_FLASH_ITF_OB_BOOT0_SELECTION(boot_select));

  if (LL_FLASH_ReadFlag_SR(flash, LL_FLASH_FLAG_BSY) != 0U)
  {
    return HAL_ERROR;
  }

  LL_FLASH_OB_SetSWBoot0(flash, (uint32_t)boot_select);

  return HAL_OK;
}

/**
  * @brief  Get the Flash OB Software boot0 state configuration.
  * @param  flash                                        Pointer to FLASH_TypeDef structure.
  * @retval hal_flash_itf_ob_boot_selection_t            Flash OB Software boot0 selection configuration.
  */
hal_flash_itf_ob_boot_selection_t HAL_FLASH_ITF_OB_GetBootSelection(const FLASH_TypeDef *flash)
{
  ASSERT_DBG_PARAM(flash != NULL);

  return (hal_flash_itf_ob_boot_selection_t)LL_FLASH_OB_GetSWBoot0(flash);
}

/**
  * @brief  Set the Flash OB Software boot0 state configuration.
  * @param  flash                      Pointer to FLASH_TypeDef structure.
  * @param  state                      Element from \ref hal_flash_itf_ob_boot_state_t enumeration.
  * @retval HAL_OK                     Flash OB Software boot0 state configuration is successfully configured.
  * @retval HAL_ERROR                  Flash OB write operation is already in progress.
  */
hal_status_t HAL_FLASH_ITF_OB_SetBoot0(FLASH_TypeDef *flash, hal_flash_itf_ob_boot_state_t state)
{
  ASSERT_DBG_PARAM(flash != NULL);
  ASSERT_DBG_PARAM(IS_FLASH_ITF_OB_BOOT_STATE(state));

  if (LL_FLASH_ReadFlag_SR(flash, LL_FLASH_FLAG_BSY) != 0U)
  {
    return HAL_ERROR;
  }

  LL_FLASH_OB_SetBoot0(flash, (uint32_t)state);

  return HAL_OK;
}

/**
  * @brief  Get the Flash OB Software boot0 state configuration.
  * @param  flash                                    Pointer to FLASH_TypeDef structure.
  * @retval hal_flash_itf_ob_boot_state_t            Flash OB Software boot0 state configuration.
  */
hal_flash_itf_ob_boot_state_t HAL_FLASH_ITF_OB_GetBoot0(const FLASH_TypeDef *flash)
{
  ASSERT_DBG_PARAM(flash != NULL);

  return (hal_flash_itf_ob_boot_state_t)LL_FLASH_OB_GetBoot0(flash);
}

/**
  * @brief  Set the Flash OB PA15 pullup configuration.
  * @param  flash          Pointer to FLASH_TypeDef structure.
  * @param  pin            Flash OB pin selection.
  * @param  pull_mode      Element from \ref hal_flash_itf_ob_pull_mode_t enumeration.
  * @retval HAL_OK         Flash OB PA15 pullup is successfully configured.
  * @retval HAL_ERROR      Flash OB write operation is already in progress.
  */
hal_status_t HAL_FLASH_ITF_OB_SetIOPull(FLASH_TypeDef *flash,
                                        uint32_t pin,
                                        hal_flash_itf_ob_pull_mode_t pull_mode)
{
  ASSERT_DBG_PARAM(flash != NULL);
  ASSERT_DBG_PARAM(pin == HAL_FLASH_ITF_OB_PA15);
  ASSERT_DBG_PARAM(IS_FLASH_ITF_OB_PULL_MODE(pull_mode));

  if (LL_FLASH_ReadFlag_SR(flash, LL_FLASH_FLAG_BSY) != 0U)
  {
    return HAL_ERROR;
  }

  if (pull_mode == HAL_FLASH_ITF_OB_PULL_UP)
  {
    LL_FLASH_OB_EnablePA15PullUp(flash);
  }
  else
  {
    LL_FLASH_OB_DisablePA15PullUp(flash);
  }

