STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_hal_flash_itf.c
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(pin);

  return HAL_OK;
}

/**
  * @brief  Get the Flash OB PA15 pullup configuration status.
  * @param  flash                               Pointer to FLASH_TypeDef structure.
  * @param  pin                                 Flash OB Pin selection.
  * @retval hal_flash_itf_ob_pin_pull_status_t  Flash OB PA15 pullup configuration is disabled or enabled.
  */
hal_flash_itf_ob_pin_pull_status_t HAL_FLASH_ITF_OB_GetIOPull(const FLASH_TypeDef *flash, uint32_t pin)
{
  ASSERT_DBG_PARAM(flash != NULL);
  ASSERT_DBG_PARAM(pin == HAL_FLASH_ITF_OB_PA15);

  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(pin);

  return (hal_flash_itf_ob_pin_pull_status_t)LL_FLASH_OB_IsEnabledPA15PullUp(flash);
}

/**
  * @brief  Enable the Flash OB High speed IO at low VDD voltage configuration.
  * @param  flash          Pointer to FLASH_TypeDef structure.
  * @param  vdd            Flash OB low VDD voltage selection.
  * @retval HAL_OK         Flash OB High speed IO at low VDD voltage configuration is successfully enabled.
  * @retval HAL_ERROR      Flash OB write operation is already in progress.
  */
hal_status_t HAL_FLASH_ITF_OB_EnableVddxHighSpeedLowVoltage(FLASH_TypeDef *flash, uint32_t vdd)
{
  ASSERT_DBG_PARAM(flash != NULL);
  ASSERT_DBG_PARAM((vdd & HAL_FLASH_ITF_OB_VDDIO_MSK) == vdd);

  if (LL_FLASH_ReadFlag_SR(flash, LL_FLASH_FLAG_BSY) != 0U)
  {
    return HAL_ERROR;
  }

  if ((vdd & HAL_FLASH_ITF_OB_VDDIO) == HAL_FLASH_ITF_OB_VDDIO)
  {
    LL_FLASH_OB_EnableVddIOHSLV(flash);
  }

  if ((vdd & HAL_FLASH_ITF_OB_VDDIO2) == HAL_FLASH_ITF_OB_VDDIO2)
  {
    LL_FLASH_OB_EnableVddIO2HSLV(flash);
  }

  return HAL_OK;
}

/**
  * @brief  Disable the Flash OB High speed IO at low VDD voltage configuration.
  * @param  flash          Pointer to FLASH_TypeDef structure.
  * @param  vdd            Flash OB low VDD voltage IO selection.
  * @retval HAL_OK         Flash OB High speed IO at low VDD voltage configuration is successfully disabled.
  * @retval HAL_ERROR      Flash OB write operation is already in progress.
  */
hal_status_t HAL_FLASH_ITF_OB_DisableVddxHighSpeedLowVoltage(FLASH_TypeDef *flash, uint32_t vdd)
{
  ASSERT_DBG_PARAM(flash != NULL);
  ASSERT_DBG_PARAM((vdd & HAL_FLASH_ITF_OB_VDDIO_MSK) == vdd);

  if (LL_FLASH_ReadFlag_SR(flash, LL_FLASH_FLAG_BSY) != 0U)
  {
    return HAL_ERROR;
  }

  if ((vdd & HAL_FLASH_ITF_OB_VDDIO) == HAL_FLASH_ITF_OB_VDDIO)
  {
    LL_FLASH_OB_DisableVddIOHSLV(flash);
  }

  if ((vdd & HAL_FLASH_ITF_OB_VDDIO2) == HAL_FLASH_ITF_OB_VDDIO2)
  {
    LL_FLASH_OB_DisableVddIO2HSLV(flash);
  }

  return HAL_OK;
}

/**
  * @brief  Check the Flash OB High speed IO at low VDD voltage configuration status.
  * @param  flash                                 Pointer to FLASH_TypeDef structure.
  * @param  vdd                                   Flash OB low VDD voltage IO selection.
  * @retval hal_flash_itf_ob_vddx_hslv_status_t   Flash OB High speed IO at low VDD voltage configuration status.
  */
hal_flash_itf_ob_vddx_hslv_status_t HAL_FLASH_ITF_OB_IsEnabledVddxHighSpeedLowVoltage(const FLASH_TypeDef *flash,
    uint32_t vdd)
{
  ASSERT_DBG_PARAM(flash != NULL);
  ASSERT_DBG_PARAM(IS_FLASH_ITF_OB_VDD(vdd));

  if (vdd == HAL_FLASH_ITF_OB_VDDIO)
  {
    return (hal_flash_itf_ob_vddx_hslv_status_t)LL_FLASH_OB_IsEnabledVddIOHSLV(flash);
  }
  else
  {
    return (hal_flash_itf_ob_vddx_hslv_status_t)LL_FLASH_OB_IsEnabledVddIO2HSLV(flash);
  }
}

/**
  * @brief  Enable the Flash OB TrustZone security configuration.
  * @param  flash             Pointer to FLASH_TypeDef structure.
  * @retval HAL_OK            Flash OB TrustZone security configuration is successfully enabled.
  * @retval HAL_ERROR         Flash OB write operation is already in progress.
  */
hal_status_t HAL_FLASH_ITF_OB_EnableTrustZone(FLASH_TypeDef *flash)
{
  ASSERT_DBG_PARAM(flash != NULL);

  if (LL_FLASH_ReadFlag_SR(flash, LL_FLASH_FLAG_BSY) != 0U)
  {
    return HAL_ERROR;
  }

  LL_FLASH_OB_EnableTrustZone(flash);

  return HAL_OK;
}

/**
  * @brief  Disable the Flash OB TrustZone configuration.
  * @param  flash             Pointer to FLASH_TypeDef structure.
  * @retval HAL_OK            Flash OB TrustZone configuration is successfully disabled.
  * @retval HAL_ERROR         Flash OB write operation is already in progress.
  */
hal_status_t HAL_FLASH_ITF_OB_DisableTrustZone(FLASH_TypeDef *flash)
{
  ASSERT_DBG_PARAM(flash != NULL);

  if (LL_FLASH_ReadFlag_SR(flash, LL_FLASH_FLAG_BSY) != 0U)
  {
    return HAL_ERROR;
  }

  LL_FLASH_OB_DisableTrustZone(flash);

  return HAL_OK;
}

/**
  * @brief  Check the Flash OB TrustZone configuration status.
  * @param  flash                                Pointer to FLASH_TypeDef structure.
  * @retval hal_flash_itf_ob_trustzone_status_t  Flash OB TrustZone configuration status.
  */
hal_flash_itf_ob_trustzone_status_t HAL_FLASH_ITF_OB_IsEnabledTrustZone(const FLASH_TypeDef *flash)
{
  ASSERT_DBG_PARAM(flash != NULL);

  return ((hal_flash_itf_ob_trustzone_status_t)LL_FLASH_OB_IsEnabledTrustZone(flash));
}

/**
  * @brief  Set the Flash OB NSecure boot address configuration.
  * @param  flash               Pointer to FLASH_TypeDef structure.
  * @param  addr_idx            Element from \ref hal_flash_itf_ob_addr_idx_t enumeration.
  * @param  boot_addr           Flash OB NSecure boot address to be configured.
  * @retval HAL_OK              Flash OB NSecure boot address is successfully configured.
  * @retval HAL_ERROR           Flash OB write operation is already in progress.
  */
hal_status_t HAL_FLASH_ITF_OB_SetNSecureBootAddr(FLASH_TypeDef *flash,
                                                 hal_flash_itf_ob_addr_idx_t addr_idx,
                                                 uint32_t boot_addr)
{
  ASSERT_DBG_PARAM(flash != NULL);
  ASSERT_DBG_PARAM(IS_FLASH_ITF_OB_ADDR_IDX(addr_idx));
  ASSERT_DBG_PARAM(boot_addr != 0U);

  if (LL_FLASH_ReadFlag_SR(flash, LL_FLASH_FLAG_BSY) != 0U)
  {
    return HAL_ERROR;
  }

