STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_hal_flash_itf.c
  LL_FLASH_OB_SetNSecBootAddr(flash, (uint32_t)addr_idx, boot_addr);

  return HAL_OK;
}

/**
  * @brief  Get the Flash OB NSecure boot address configuration.
  * @param  flash               Pointer to FLASH_TypeDef structure.
  * @param  addr_idx            Element from \ref hal_flash_itf_ob_addr_idx_t enumeration.
  * @retval uint32_t            The configured boot address.
  */
uint32_t HAL_FLASH_ITF_OB_GetNSecureBootAddr(const FLASH_TypeDef *flash, const hal_flash_itf_ob_addr_idx_t addr_idx)
{
  ASSERT_DBG_PARAM(flash != NULL);
  ASSERT_DBG_PARAM(IS_FLASH_ITF_OB_ADDR_IDX(addr_idx));

  return LL_FLASH_OB_GetNSecBootAddr(flash, (uint32_t)addr_idx);
}
/**
  * @}
  */

/** @addtogroup FLASH_ITF_Exported_Functions_Group4
  * @{
This subsection provides a set of functions allowing to handle the Flash interface interrupt subroutines:

- Call HAL_FLASH_ITF_IRQHandler() to handle Flash OB write operations.

- Call HAL_FLASH_ITF_OB_ProgramCpltCallback() to be redefined for the Flash OB complete write operation callback.

- Call HAL_FLASH_ITF_OB_ErrorCallback() to be redefined the Flash OB operation write error callback.

  */

/**
  * @brief  Handle the Flash interface interrupts requests.
  * @param  flash               Pointer to FLASH_TypeDef structure.
  */
void HAL_FLASH_ITF_IRQHandler(FLASH_TypeDef *flash)
{
  uint32_t flags;

  ASSERT_DBG_PARAM(flash != NULL);

#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
  flags = LL_FLASH_NS_ReadFlag_SR(flash, LL_FLASH_FLAG_ALL);

  LL_FLASH_NS_ClearFlag(flash, LL_FLASH_FLAG_ALL);
#else
  flags = LL_FLASH_ReadFlag_SR(flash, LL_FLASH_FLAG_ALL);

  LL_FLASH_ClearFlag(flash, LL_FLASH_FLAG_ERRORS_ALL);
#endif /* __ARM_FEATURE_CMSE */

  if ((flags & LL_FLASH_FLAG_EOP) != 0U)
  {
    HAL_FLASH_ITF_OB_ProgramCpltCallback(flash);
  }

  if ((flags & LL_FLASH_FLAG_OPERR) != 0U)
  {
    HAL_FLASH_ITF_OB_ErrorCallback(flash);
  }
}

/**
  * @brief  Flash OB complete write operation callback.
  * @param  flash               Pointer to FLASH_TypeDef structure.
  */
__WEAK void HAL_FLASH_ITF_OB_ProgramCpltCallback(FLASH_TypeDef *flash)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(flash);

  /*! <b>WARNING:</b> This function must not be modified, when the callback is needed,
                      HAL_FLASH_ITF_OB_ProgramCpltCallback() function could be implemented in the user file */
}

/**
  * @brief  Flash OB operation write error callback.
  * @param  flash               Pointer to FLASH_TypeDef structure.
  */
__WEAK void HAL_FLASH_ITF_OB_ErrorCallback(FLASH_TypeDef *flash)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(flash);

  /*! <b>WARNING:</b> This function must not be modified, when the callback is needed,
                      HAL_FLASH_ITF_OB_ErrorCallback() function could be implemented in the user file */
}

/**
  * @}
  */

/** @addtogroup FLASH_ITF_Exported_Functions_Group5
  * @{
  * This subsection provides a set of functions for option bytes process:

  * - Call HAL_FLASH_ITF_OB_Program() to program the Flash option bytes interface.

  * - Call HAL_FLASH_ITF_OB_Launch() to launch the Flash option bytes interface.

  */

/**
  * @brief  Program the Flash option bytes interface settings.
  * @param  flash             Pointer to FLASH_TypeDef structure.
  * @retval HAL_OK            Flash option bytes settings successfully programmed.
  * @retval HAL_ERROR         Flash option bytes settings program error occurred.
  */
hal_status_t HAL_FLASH_ITF_OB_Program(FLASH_TypeDef *flash)
{
  uint32_t tmp_sr;

  ASSERT_DBG_PARAM(flash != NULL);

  LL_FLASH_OB_StartModification(flash);

  tmp_sr = LL_FLASH_ReadFlag_SR(flash, LL_FLASH_FLAG_BSY);

  while (tmp_sr != 0U)
  {
    tmp_sr = LL_FLASH_ReadFlag_SR(flash, LL_FLASH_FLAG_BSY);
  }

  if (LL_FLASH_IsActiveFlag_OPTWERR(flash) != 0U)
  {
    LL_FLASH_ClearFlag_OPTWERR(flash);

    return HAL_ERROR;
  }

  return HAL_OK;
}

/**
  * @brief  Launch the Flash option bytes interface settings.
  * @param  flash                Pointer to FLASH_TypeDef structure.
  * @retval HAL_OK               Flash option bytes settings successfully launched.
  * @retval HAL_ERROR            Flash option bytes settings loading error occurred.
  */
hal_status_t HAL_FLASH_ITF_OB_Launch(FLASH_TypeDef *flash)
{
  ASSERT_DBG_PARAM(flash != NULL);

  LL_FLASH_OB_Launch(flash);

  return HAL_ERROR;
}

/**
  * @}
  */

#endif /* USE_HAL_FLASH_ITF_MODULE */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */
